Repository: Aburaihanai/izalams
Catalog: locale/ig/LC_MESSAGES/django.po
Languages: ig

source: Registration successful! Your branch leader must activate your account before you can login.
ig: Ndebanye aha gara nke ọma! Onye ndu alaka gị ga-arụrịrị ọrụ asusu gị tupu ị banye.

source: Account for {profile.user.get_full_name()} activated.
ig: Emeela ka asusu maka {profile.user.get_full_name()} rụọ ọrụ.

source: Username
ig: Aha njirimara

source: Full Name
ig: Aha zuru ezu

source: Phone
ig: Ekwentị

source: Bank Code
ig: Koodu ụlọ akụ

source: Account No
ig: Nọmba asusu

source: Official memo sent.
ig: E zigala ozi gọọmentị.

source: Video published to feed.
ig: Ebipụtala vidiyo na feed.

source: Username updated.
ig: Emegharịrị aha njirimara.

source: Username already taken.
ig: E jiri aha njirimara a mee ihe.

source: Member
ig: Onye otu

source: Amount
ig: Ego ole

source: Reference
ig: Ntụaka

source: Status
ig: Ọnọdụ

source: Date
ig: Ụbọchị

source: Enter your full name
ig: Tinye aha gị zuru ezu

source: Enter your email address
ig: Tinye adresị ozi-e gị

source: Enter your phone number
ig: Tinye nọmba ekwentị gị

source: e.g., Zakat
ig: dịka ọmụmaatụ, Zakat

source: Enter any additional notes (optional)
ig: Tinye ihe edeturu ọ bụla ọzọ (nhọrọ)

source: Email
ig: Ozi-e

source: Phone Number
ig: Nọmba ekwentị

source: Amount (₦)
ig: Ego ole (₦)

source: Purpose
ig: Ebumnuche

source: Notes (Optional)
ig: Ihe edeturu (Nhọrọ)

source: Payment Method
ig: Ụzọ ịkwụ ụgwọ

source: Expiry Date
ig: Ụbọchị njedebe

source: Cardholder Name
ig: Aha onye nwe kaadị

source: Name as it appears on card
ig: Aha dịka ọ dị na kaadị

source: English
ig: Bekee

source: Hausa
ig: Awụsa

source: Arabic
ig: Arabụ

source: French
ig: Faranse

source: Warning: Delete Account
ig: Ịdọ aka ná ntị: Hichapụ asusu

source: Are you sure you want to delete your JIBWIS profile? This action cannot be undone.
ig: Ị doro anya na ị chọrọ ihichapụ profaịlụ JIBWIS gị? Enweghị ike ịkagbu ihe a emeela.

source: Yes, Delete My Account
ig: Ee, hichapụ asusu m

source: Cancel
ig: Kagbuo

source: Edit Profile Details
ig: Dezie nkọwa profaịlụ

source: Personal Info
ig: Ozi gbasara onwe gị

source: Organization & Payment
ig: Nzukọ na Ịkwụ ụgwọ

source: Update Records
ig: Megharịa ndekọ

source: Portal Login
ig: Nbanye Portal

source: Login
ig: Banye

source: Forgot Password?
ig: I chefuru paswọọdụ gị?

source: Unit Directory
ig: Ndekọ Nkeji

source: Official File
ig: Faịlụ Gọọmentị

source: Suspend Member
ig: Kwụsịtụ onye otu

source: Restore/Activate
ig: Weghachi/Mee ka ọ rụọ ọrụ

source: Direct Memo
ig: Ozi ozugbo

source: Disburse Payment
ig: Kwụọ ụgwọ

source: Payment Locked
ig: Akpọchiri ịkwụ ụgwọ

source: Account Currently Suspended
ig: Akụsịtụla asusu ugbu a

source: This member cannot receive payments or access unit resources until restored.
ig: Onye otu a enweghị ike ịnweta ego ma ọ bụ ihe onwunwe nkeji ruo mgbe eweghachiri ya.

source: Official Personnel File
ig: Faịlụ ndị ọrụ gọọmentị

source: Assigned Position
ig: Ọkwá e kenyere

source: Contact Number
ig: Nọmba ekwentị

source: Verified Banking Data
ig: Data ụlọ akụ enyochara

source: Bank Name
ig: Aha ụlọ akụ

source: Account Number
ig: Nọmba asusu

source: Credentials
ig: Asambodo

source: Export Official PDF
ig: Bupụ PDF gọọmentị

source: Remove Record
ig: Wepụ ndekọ

source: Reason for suspending
ig: Ihe kpatara nkwụsịtụ

source: Violation of rules
ig: Mmebi iwu

source: PERMANENT REMOVAL: Are you sure you want to delete the records for
ig: IWEPỤ KAUPỤ: Ị doro anya na ị chọrọ ihichapụ ndekọ maka

source: This is only for deceased members or permanent resignations.
ig: Nke a bụ naanị maka ndị otu nwụrụ anwụ ma ọ bụ ndị gbara arụkwaghịm kpamkpam.

source: Directory
ig: Ndekọ

source: Select members to send bulk notifications or manage accounts.
ig: Họrọ ndị otu ka e zigara ozi igwe ma ọ bụ jikwaa asusu ha.

source: Message Selected
ig: Ozi ahọpụtara

source: Personnel
ig: Ndị ọrụ

source: Position
ig: Ọkwá

source: Actions
ig: Omume

source: Reactivate
ig: Mee ka ọ rụọ ọrụ ọzọ

source: Send Bulk Message
ig: Zipụ ozi igwe

source: Subject
ig: Isiokwu

source: Message Body
ig: Isi ozi

source: Send to Selected Members
ig: Zigara ndị otu ahọpụtara

source: Member Registration
ig: Ndebanye aha onye otu

source: Join the JIBWIS Digital Management System
ig: Soro na JIBWIS Digital Management System

source: Account Information
ig: Ozi asusu

source: Organizational Role
ig: Ọrụ na nzukọ

source: Submit Membership Request
ig: Nyefee arịrịọ onye otu

source: Navigation
ig: Ntughari

source: Full Directory
ig: Ndekọ zuru ezu

source: Unit Filters
ig: Ihe nzacha nkeji

source: Member Status
ig: Ọnọdụ onye otu

source: All Members
ig: Ndị otu niile

source: Active Only
ig: Naanị ndị nọ n'ọrụ

source: Suspended
ig: Ndị a kwụsịrị

source: Position/Role
ig: Ọkwá/Ọrụ

source: Apply Filters
ig: Tinye ihe nzacha

source: Reset All
ig: Tọgharịa niile

source: Search by name or phone in your unit...
ig: Chọọ site n'aha ma ọ bụ ekwentị na nkeji gị...

source: Search
ig: Chọọ

source: Results for
ig: Nsonaazụ maka

source: Account Info
ig: Ozi asusu

source: Management
ig: Nlekọta

source: Active
ig: Ọrụ

source: View File
ig: Lelee faịlụ

source: Suspend
ig: Kwụsịtụ

source: Activate
ig: Mee ka ọ rụọ ọrụ

source: Permanent Removal
ig: Iwepụ kpamkpam

source: No members found in your unit matching this criteria.
ig: Ahụghị ndị otu n'ime nkeji gị dabara na njirisi a.

source: WARNING: This will PERMANENTLY delete
ig: ỊDỌ AKA NÁ NTỊ: Nke a ga-ehichapụ kpamkpam

source: from JIBWIS records. Proceed?
ig: site na ndekọ JIBWIS. Gaa n'ihu?

source: New Official Memo
ig: Ozi gọọmentị ọhụrụ

source: Recipient
ig: Onye natara ya

source: Enter memo title...
ig: Tinye isiokwu ozi...

source: Type your message here...
ig: Dee ozi gị ebe a...

source: Send Message
ig: Zipụ ozi

source: Change Username
ig: Gbanwee aha njirimara

source: Current Username:
ig: Aha njirimara ugbu a:

source: Update Username
ig: Megharịa aha njirimara

source: JIBWIS Nigeria Portal
ig: Portal JIBWIS Nigeria

source: Home
ig: Ụlọ

source: Logout
ig: Pụọ

source: Join Us
ig: Soro anyị

source: Donate
ig: Nye onyinye

source: Nigeria National Headquarters
ig: Isi ụlọ ọrụ mba Nigeria

source: Digital Management System | Developed for JIBWIS Nigeria
ig: Digital Management System | Emepụtara maka JIBWIS Nigeria

source: Paystack Transfer Balance
ig: Ego nnyefe Paystack fọdụrụ

source: Funds available for immediate disbursement.
ig: Ego dị maka ịkwụ ụgwọ ozugbo.

source: Refresh Balance
ig: Megharịa ego fọdụrụ

source: Category Payroll
ig: Payroll otu

source: Managing
ig: Na-achịkwa

source: Search by name or unit/state...
ig: Chọọ site n'aha ma ọ bụ nkeji/steeti...

source: Filter
ig: Nzacha

source: Scope
ig: Ohere

source: Full Hierarchy (National)
ig: Sistemu zuru ezu (Mba)

source: Restricted
ig: E gbochiri

source: Unit / Level
ig: Nkeji / Ọkwa

source: Account
ig: Asusu

source: No matches found for
ig: Ahụghị ihe dabara na

source: Selected
ig: Ahọpụtara

source: Execute Disbursement
ig: Mee ịkwụ ụgwọ

source: Command Center
ig: Ebe njikwa

source: Process unit disbursements and allowances.
ig: Mee ịkwụ ụgwọ nkeji na ego nkwado.

source: View and manage all registered members.
ig: Lelee ma jikwaa ndị otu niile debanyere aha.

source: My Inbox
ig: Igbe ozi m

source: Check communications and unit updates.
ig: Lelee nkwukọrịta na mmelite nkeji.

source: New
ig: Ọhụrụ

source: Recent Messages
ig: Ozi nso nso a

source: No new messages.
ig: Enweghị ozi ọhụrụ.

source: National Disciplinary Portal
ig: Portal ịdọ aka ná ntị mba

source: High Clearance Only
ig: Naanị maka ndị nwere ikike dị elu

source: Reporter (Member)
ig: Onye mkpesa (Onye otu)

source: Subject (Leader)
ig: Isiokwu (Onye ndu)

source: Complaint Summary
ig: Nchịkọta mkpesa

source: Action
ig: Omume

source: Pending Review
ig: Na-echere nyocha

source: Under Investigation
ig: A na-enyocha ya

source: Resolved
ig: E doziela

source: No active reports found.
ig: Ahụghị mkpesa ọ bụla na-arụ ọrụ.

source: Bank Transfer Payment
ig: Ịkwụ ụgwọ nnyefe ụlọ akụ

source: Contribution Summary
ig: Nchịkọta onyinye

source: Your Name:
ig: Aha gị:

source: Amount:
ig: Ego ole:

source: Purpose:
ig: Ebumnuche:

source: Verification Reference:
ig: Ntụaka nkwenye:

source: Bank Account Details
ig: Nkọwa asusu ụlọ akụ

source: Bank Name:
ig: Aha ụlọ akụ:

source: Account Name:
ig: Aha asusu:

source: Account Number:
ig: Nọmba asusu:

source: Reference Note:
ig: Ihe edeturu maka ntụaka:

source: Important Instructions:
ig: Ntuziaka dị mkpa:

source: Please use the <strong>reference code (%(ref)s)</strong> as the payment narration/memo.
ig: Biko jiri <strong>koodu ntụaka (%(ref)s)</strong> dịka nkọwa ịkwụ ụgwọ.

source: Verification may take up to 24 hours to reflect.
ig: Nkwenye nwere ike iwe ruru awa iri abụọ na anọ tupu ọ pụta.

source: Please keep your transfer receipt for your records.
ig: Biko debe nnata nnyefe gị maka ndekọ gị.

source: For support, contact us at +234 800 000 0000.
ig: Maka nkwado, kpọtụrụ anyị na +234 800 000 0000.

source: Confirm Payment
ig: Tabbatar da ịkwụ ụgwọ

source: To confirm that you have made the transfer, please check the box below:
ig: Iji gosi na i meela nnyefe, biko gaa na igbe dị n'okpuru a:

source: I confirm that I have sent ₦%(amt)s to the account stated above.
ig: Agosiri m na e zigara m ₦%(amt)s na asusu ahụ a kọwara n'elu.

source: I Have Sent the Money
ig: E zigara m ego ahụ

source: Go Back
ig: Laghachi azụ

source: Card Payment
ig: Ịkwụ ụgwọ kaadị

source: You will be redirected to a secure payment gateway to complete your transaction.
ig: A ga-atụgharị gị gaa na ebe ịkwụ ụgwọ nchekwa iji mechaa azụmahịa gị.

source: Reference Code:
ig: Koodu ntụaka:

source: Card Number
ig: Nọmba kaadị

source: Expiry (MM/YY)
ig: Njedbe (ỌN/AF)

source: Name on Card
ig: Aha dị na kaadị

source: Your card details are securely encrypted. We do not store your full card information on our servers.
ig: A kpuru nkọwa kaadị gị na nchekwa. Anyị anaghị echekwa nkọwa kaadị gị zuru ezu na sava anyị.

source: Pay ₦%(amt)s
ig: Kwụọ ₦%(amt)s

source: Secure
ig: Nchekwa

source: Contribution Confirmation
ig: Nkwenye onyinye

source: Dear %(name)s,
ig: %(name)s ọ hụrụ n'anya,

source: We are pleased to inform you that your contribution has been received.
ig: Obi dị anyị ụtọ ịgwa gị na anyị anatala onyinye gị.

source: Contribution Details:
ig: Nkọwa onyinye:

source: Payment Method:
ig: Ụzọ ịkwụ ụgwọ:

source: Date:
ig: Ụbọchị:

source: Our sincere gratitude goes to everyone who contributes. Your support will greatly help the community.
ig: Ekele anyị sitere n'obi na-aga n'ebe onye ọ bụla na-enye onyinye nọ. Nkwado gị ga-enyere obodo aka nke ukwuu.

source: If you have any questions, please reply to this email or contact us at:
ig: Ọ bụrụ na ị nwere ajụjụ ọ bụla, biko zaa ozi-e a ma ọ bụ kpọtụrụ anyị na:

source: Izala Group. All rights reserved.
ig: Izala Group. Ikike niile echekwara.

source: Dedicated to serving the community
ig: Raara onwe ya nye ijere obodo ozi

source: Contribute Zakat/Sadaqah
ig: Nye onyinye Zakat/Sadaqah

source: Donor Information
ig: Ozi onye nyere onyinye

source: Contribution Details
ig: Nkọwa onyinye

source: Minimum amount is ₦100
ig: Ego kacha nta bụ ₦100

source: Use your bank debit/credit card
ig: Jiri kaadị ụlọ akụ gị

source: Bank Transfer
ig: Nnyefe ụlọ akụ

source: Transfer directly from your bank app
ig: Nyefee ego ozugbo site na app ụlọ akụ gị

source: Proceed to Contribute
ig: Gaa n'ihu inye onyinye

source: Minimum donation amount is ₦100
ig: Ego onyinye kacha nta bụ ₦100

source: Please select a payment method
ig: Biko họrọ ụzọ ịkwụ ụgwọ

source: Donation Records
ig: Ndekọ onyinye

source: Add Manual Donation
ig: Tinye onyinye site n'aka

source: Gateway Settings
ig: Ntọala Gateway

source: All Statuses
ig: Ọnọdụ niile

source: Pending
ig: Na-echere

source: Completed
ig: Emechaala

source: Failed
ig: O nweghị isi

source: All Methods
ig: Ụzọ niile

source: Cash
ig: Ego kachapụ

source: From
ig: Site na

source: To
ig: Gaa na

source: Clear
ig: Hichapụ

source: Total Donations:
ig: Onyinye niile:

source: Donor
ig: Onye nyere onyinye

source: Method
ig: Ụzọ

source: No email
ig: Enweghị ozi-e

source: General
ig: Izugbe

source: Donation Details
ig: Nkọwa onyinye

source: Donor:
ig: Onye nyere onyinye:

source: Email:
ig: Ozi-e:

source: Phone:
ig: Ekwentị:

source: Method:
ig: Ụzọ:

source: Status:
ig: Ọnọdụ:

source: Notes:
ig: Ihe edeturu:

source: None
ig: Ọ dịghị

source: Transaction ID:
ig: ID Azụmahịa:

source: No donations found
ig: Ahụghị onyinye ọ bụla

source: Payment Pending
ig: Ịkwụ ụgwọ na-echere

source: We are waiting to confirm your contribution
ig: Anyị na-eche nkwenye nke onyinye gị

source: Donor Name:
ig: Aha onye nyere onyinye:

source: Reference Number:
ig: Nọmba ntụaka:

source: What happens next?
ig: Gịnị ga-eme ọzọ?

source: We will verify the bank records for your payment.
ig: Anyị ga-enyocha ndekọ ụlọ akụ maka ịkwụ ụgwọ gị.

source: This process may take up to 24 hours.
ig: Ihe a nwere ike iwe ruru awa iri abụọ na anọ.

source: You will receive a confirmation email once the status is updated.
ig: Ị ga-enweta ozi-e nkwenye ozugbo emelitere ọnọdụ ya.

source: If not confirmed within 2 days, please contact our support.
ig: Ọ bụrụ na akwadoghị ya n'ime ụbọchị abụọ, biko kpọtụrụ ndị nkwado anyị.

source: Make Another Contribution
ig: Nye onyinye ọzọ

source: Check Status
ig: Lelee ọnọdụ

source: For inquiries, contact us at
ig: Maka ajụjụ, kpọtụrụ anyị na

source: or
ig: ma ọ bụ

source: Check Payment Status
ig: Lelee ọnọdụ ịkwụ ụgwọ

source: Checking payment status...
ig: Na-elele ọnọdụ ịkwụ ụgwọ...

source: Refresh
ig: Megharịa

source: Payment Successful!
ig: Ịkwụ ụgwọ gara nke ọma!

source: Your payment was confirmed on
ig: A kwadoro ịkwụ ụgwọ gị na

source: View Confirmation
ig: Lelee nkwenye

source: We are still waiting to confirm your payment
ig: Anyị ka na-eche nkwenye nke ịkwụ ụgwọ gị

source: No Update Found
ig: Ahụghị mmelite ọ bụla

source: There is no new information regarding your payment
ig: Enweghị ozi ọhụrụ gbasara ịkwụ ụgwọ gị

source: Thank You!
ig: Daalụ!

source: Your contribution was successful
ig: Onyinye gị gara nke ọma

source: We will send a confirmation receipt to your email
ig: Anyị ga-eziga nnata nkwenye na ozi-e gị

source: once the transaction is fully processed
ig: ozugbo emechara azụmahịa ahụ

source: Print Receipt
ig: Bipụta nnata

source: If you have any questions regarding this contribution,
ig: Ọ bụrụ na ị nwere ajụjụ ọ bụla gbasara onyinye a,

source: please contact us at
ig: biko kpọtụrụ anyị na

source: Authorize Disbursement
ig: Nye ikike ịkwụ ụgwọ

source: Confirm Unit Payroll
ig: Tabbatar na Payroll nkeji

source: You are about to process payments for selected members of <strong>%(unit)s</strong>. This action will trigger bank transfers and cannot be reversed once executed.
ig: Ị na-achọ ịkwụ ụgwọ maka ndị otu ahọpụtara na <strong>%(unit)s</strong>. Ihe a ga-ebido nnyefe ego n'ụlọ akụ ma enweghị ike ịkagbu ya ozugbo emeela ya.

source: Only 'Active' members selected in the table will be processed.
ig: Naanị ndị otu 'Active' ahọpụtara na tebụl ka a ga-akwụ ụgwọ.

source: Review List
ig: Nyochaa ndepụta

source: Process Now
ig: Mee ya ugbu a

source: Unit Leader
ig: Onye ndu nkeji

source: My Profile
ig: Profaịlụ m

source: Payroll History
ig: Akụkọ ịkwụ ụgwọ

source: Updates
ig: Mmelite

source: Welcome to our official portal. Stay tuned for live updates.
ig: Nabata na portal gọọmentị anyị. Na-eche mmelite dị ndụ.

source: Unifying the Sunnah across Nigeria: Admin • Ulama • FAG
ig: Ịdị n'otu nke Sunnah n'ofe Nigeria: Admin • Ulama • FAG

source: Join Now
ig: Soro ugbu a

source: Administration
ig: Nchịkwa

source: National to Ward level leadership coordination.
ig: Nhazi ndị ndu site n'ọkwa Mba ruo Ward.

source: Management of scholars and educational backgrounds.
ig: Nlekọta nke ndị ọkà mmụta na agụmakwụkwọ ha.

source: Divisional, Detachment, and Unit leadership.
ig: Ndị ndu Divisional, Detachment, na Unit.

source: Visit Us
ig: Leta anyị

source: JIBWIS National Headquarters,
ig: Isi ụlọ ọrụ JIBWIS Mba,

source: Latest Announcements
ig: Ọkwa ọhụrụ

source: Read More
ig: Gụkwuo

source: Share
ig: Kekọrịta

source: Download
ig: Budata

source: Official Leader Directory
ig: Ndekọ ndị ndu gọọmentị

source: Verified National and State Leadership of JIBWIS Nigeria
ig: Ndị ndu Mba na Steeti nke JIBWIS Nigeria enyochara

source: Search by name, position, or unit...
ig: Chọọ site n'aha, ọkwa, ma ọ bụ nkeji...

source: View Profile
ig: Lelee profaịlụ

source: Directory Updating
ig: Na-emelite ndekọ

source: The leadership directory is currently being synchronized.
ig: A na-emelite ndekọ ndị ndu ugbu a.

source: Return to Dashboard
ig: Laghachi na Dashboard

source: Warning:
ig: Ịdọ aka ná ntị:

source: Access the JIBWIS Management Portal
ig: Banye na JIBWIS Management Portal

source: Password
ig: Paswọọdụ

source: Login to Account
ig: Banye na asusu

source: Not registered?
ig: Ị debanyeghị aha?

source: Apply Now
ig: Tinye akwụkwọ ugbu a

source: Reset Your Password
ig: Tọgharịa paswọọdụ gị

source: Enter your email address below, and we'll email instructions for setting a new one.
ig: Tinye adresị ozi-e gị n'okpuru, anyị ga-ezitere gị ntuziaka maka ịtọ paswọọdụ ọhụrụ.

source: Send Reset Email
ig: Zipụ ozi-e ntọgharị

source: Password Reset Complete
ig: Ntọgharị paswọọdụ agwụla

source: Your new password has been set. You may go ahead and log in now.
ig: Edobela paswọọdụ ọhụrụ gị. Ị nwere ike ịga n'ihu banye ugbu a.

source: Login to Portal
ig: Banye na Portal

source: New Password
ig: Paswọọdụ ọhụrụ

source: Please enter your new password below.
ig: Biko tinye paswọọdụ ọhụrụ gị n'okpuru.

source: Reset Password
ig: Tọgharịa paswọọdụ

source: This password reset link is invalid or has expired.
ig: Link ntọgharị paswọọdụ a adịghị mma ma ọ bụ na ọ gwụla.

source: Request a new link
ig: Rịọ maka link ọhụrụ

source: Check Your Email
ig: Lelee ozi-e gị

source: We've emailed you instructions for setting your password. You should receive them shortly.
ig: Anyị ezitere gị ozi-e nwere ntuziaka maka ịtọ paswọọdụ gị. Ị ga-enweta ya n'oge na-adịghị anya.

source: If you don't receive an email, please ensure you've entered the address you registered with and check your spam folder.
ig: Ọ bụrụ na ị nataghị ozi-e, biko hụ na itinye adresị i debanyere aha na ya ma lelee igbe spam gị.

source: To initiate the password reset process for your JIBWIS account, click the link below:
ig: Iji malite usoro ntọgharị paswọọdụ maka asusu JIBWIS gị, pịa link dị n'okpuru a:

source: If clicking the link doesn't work, please copy and paste the URL into your browser.
ig: Ọ bụrụ na ịpị link ahụ anaghị arụ ọrụ, biko detuo na mado URL ahụ na ihe nchọgharị gị.

source: Disbursement Ledger
ig: Ndekọ ịkwụ ụgwọ

source: New Disbursement
ig: Ịkwụ ụgwọ ọhụrụ

source: Date & Time
ig: Ụbọchị na Oge

source: Paid
ig: Akpụọla

source: No disbursement records found.
ig: Ahụghị ndekọ ịkwụ ụgwọ ọ bụla.

source: Pending Member Verifications
ig: Nkwenye ndị otu na-echere

source: Unit/Jurisdiction
ig: Nkeji/Ikike

source: Registration Date
ig: Ụbọchị ndebanye aha

source: Approve
ig: Kwado

source: Bank:
ig: Banki:

source: Education:
ig: Agụmakwụkwọ:

source: Position:
ig: Ọkwa:

source: Verified via Moniepoint/Paystack:
ig: Enyochara site na Moniepoint/Paystack:

source: Account Validated
ig: Asusu enyochara

source: Account Not Validated
ig: Asusu anaghị enyocha

source: Upload Short Video
ig: Bulite obere vidiyo

source: Videos will auto-play on hover on the landing page. Recommended format: Vertical (9:16).
ig: Vidiyo ga-amalite n'onwe ya mgbe aka kpara ya na peeji mbụ. Ụdị a tụrụ aro: N'ogologo (9:16).

source: Publish Video
ig: Bipụta vidiyo

source: Cancel and Return
ig: Kagbuo ma laghachi azụ
