Repository: Aburaihanai/izalams
Catalog: locale/yo/LC_MESSAGES/django.po
Languages: yo

source: You must be assigned to a unit to send official memos.
yo: O gbọdọ wa ni abẹ ẹka kan pato lati le fi iwe iranti (memo) ranṣẹ.

source: Jurisdiction Error: You can only message members within your region.
yo: Aṣiṣe Agbegbe: Awọn ọmọ ẹgbẹ to wa ni agbegbe rẹ nikan ni o le fi ifiranṣẹ ranṣẹ si.

source: Update your personal and organizational records
yo: Ṣe imudojuiwọn awọn akọsilẹ rẹ ati ti agbari rẹ

source: When you update your bank info, our system verifies the name directly with your bank. Ensure the account number matches the bank selected.
yo: Nigbati o ba ṣe imudojuiwọn alaye ile-ifowopamọ rẹ, eto wa yoo rii daju orukọ rẹ lati banki rẹ. Rii daju pe nọmba akọọlẹ rẹ ba ile-ifowopamọ ti o yan mu.

source: Discard Changes
yo: Pa awọn ayipada rẹ rẹ

source: Save & Verify Records
yo: Fipamọ ki o si fidi awọn akọsilẹ mulẹ

source: Verifying...
yo: A n ṣayẹwo rẹ...

source: Total
yo: Àpapọ̀

source: Received
yo: Ifiranṣẹ ti o wọle

source: Delete Permanent
yo: Pa rẹ patapata

source: Reply
yo: Fesi

source: Dismiss
yo: Yọ kuro

source: Your official inbox is currently empty.
yo: Apoti ifiranṣẹ rẹ ti ṣofo lọwọlọwọ.

source: Run Paystack Verification
yo: Ṣe ayẹwo Paystack

source: Global Identifier
yo: ID Idanimọ Agbaye

source: Changes made here are logged and visible to State/National auditors. Ensure all deactivations have documented reasons.
yo: Awọn ayipada ti o ba ṣe ni ibi ni a kọ silẹ ti awọn oluyẹwo ti Ipinle ati ti Orilẹ-ede si n rii. Rii daju pe idi ti o fi n fagile iṣẹ ẹnikẹni wa ni akọsilẹ.

source: WARNING: This will permanently delete all data for
yo: IKILO: Eyi yoo pa gbogbo alaye rẹ rẹ patapata fun

source: Continue?
yo: Tẹsiwaju?

source: Enter reason for deactivation (e.g., Transfer, Disciplinary, Resignation):
yo: Tẹ idi ti o fi fẹ fagile iṣẹ ẹni naa (apẹẹrẹ: Gbigbe lọ si ibomiiran, Ibawi, Ififẹsẹntẹ):

source: Manage unit personnel and broadcast notifications.
yo: Ṣakoso awọn oṣiṣẹ ẹka ati fi ifitonileti gbogboogbo ranṣẹ.

source: Export
yo: Mú alaye jáde

source: Personnel in your unit will appear here.
yo: Awọn oṣiṣẹ ninu ẹka rẹ yoo han ni ibi.

source: Unit Broadcast
yo: Ifitonileti Ẹka

source: This message will be sent to the selected unit members.
yo: Ifiranṣẹ yii yoo lọ si ọdọ awọn ọmọ ẹka ti o yan.

source: e.g., Monthly Meeting
yo: apẹẹrẹ: Ipade Oṣooṣu

source: Send Broadcast
yo: Fi ifitonileti gbogboogbo ranṣẹ

source: WARNING: Permanently delete
yo: IKILO: Pa rẹ patapata

source: This cannot be undone.
yo: O ko le pada sẹhin lẹhin eyi.

source: Unit & Department
yo: Ẹka & Ẹka Iṣẹ

source: Location Hierarchy
yo: Ipo Ibugbe

source: LGA
yo: Ijọba Ibile

source: Ward / Branch Name
yo: Wọọdu / Orukọ Ẹka

source: Submit for Leader Approval
yo: Fi ranṣẹ fun ifọwọsi olori

source: Broadcasting Option
yo: Aṣayan Ifitonileti

source: Send only to this individual
yo: Fi ranṣẹ si ẹni yii nikan

source: All Admin in this Unit
yo: Gbogbo Alabojuto (Admin) ninu ẹka yii

source: All Ulama in this Unit
yo: Gbogbo Awọn Onimọ-ẹsin (Ulama) ninu ẹka yii

source: Leave as 'Individual' to message only the user above, or select a group to message everyone in their category.
yo: Fi silẹ gẹgẹ bi 'Ẹni kọọkan' lati fi ranṣẹ si ẹni ti o wa loke nikan, tabi yan ẹgbẹ kan lati fi ranṣẹ si gbogbo eniyan ni abẹ rẹ.

source: Tracking official broadcasts and replies.
yo: A n tọpa awọn ifitonileti ati awọn idahun.

source: Sent
yo: Ifiranṣẹ ti o ti lọ

source: Delivered
yo: O ti lọ

source: Sent on
yo: O lọ ni

source: You haven't sent any memos yet.
yo: O ko ti fi iwe iranti (memo) eyikeyi ranṣẹ.

source: Are you sure you want to REJECT and DELETE this application?
yo: Ṣe o ni idaniloju pe o fẹ kọ ati pa iwe ohun elo yii rẹ?

source: Reject Application
yo: Kọ ohun elo yii

source: No pending requests. Your unit is fully approved.
yo: Ko si ohun elo kankan ti o n duro. A ti fọwọsi ẹka rẹ ni kikun.

source: Manage unit personnel records.
yo: Ṣakoso awọn akọsilẹ oṣiṣẹ ẹka.

source: Unit communications.
yo: Ibaraẹnisọrọ ẹka.

source: Upload to Gallery
yo: Gbe fọto si ibi aworan

source: Write something for your unit...
yo: Kọ nkan silẹ fun ẹka rẹ...

source: This will only be visible to members of
yo: Awọn ọmọ ẹka yii nikan ni yoo rii eyi

source: Post to Unit
yo: Fi ranṣẹ si ẹka

source: Image Title
yo: Akọle Fọto

source: e.g., Annual Conference
yo: apẹẹrẹ: Apero Ọdọọdun

source: Security Notice
yo: Itoye Aabo

source: National Management Information System
yo: Eto Isakoso Alaye ti Orilẹ-ede

source: Your account may be awaiting leader approval from your assigned Ward/Unit.
yo: Akọọlẹ rẹ le wa ni iduro fun ifọwọsi olori lati Wọọdu tabi Ẹka rẹ.

source: Sign In
yo: Wọle

source: Forgot your security credentials?
yo: O ha gbagbe ọrọ igbaniwọle rẹ?

source: Submit Enrollment
yo: Fi ohun elo ranṣẹ

source: Authorized Personnel Only.
yo: Awọn oṣiṣẹ ti a fọwọsi nikan ni o le wọle.

source: Video published to feed.
yo: Wọ́n ti gbé fídíò jáde sórí ìkànnì.

source: Username updated.
yo: Wọ́n ti ṣàtúnṣe orúkọ-ìwọlé.

source: Username already taken.
yo: Orúkọ-ìwọlé yìí ti wà ní lílò tẹ́lẹ̀.

source: Member
yo: Ọmọ-ẹgbẹ́

source: Amount
yo: Iye owó

source: Reference
yo: Ìtọ́kasí

source: Status
yo: Ipò

source: Date
yo: Ọjọ́

source: Enter your full name
yo: Tẹ orúkọ rẹ lẹ́kùn-únrẹ́rẹ́

source: Enter your email address
yo: Tẹ àdírẹ́sì í-mèlì rẹ

source: Enter your phone number
yo: Tẹ nọ́ńbà fóònù rẹ

source: e.g., Zakat
yo: fún àpẹẹrẹ, Zakāt

source: Enter any additional notes (optional)
yo: Tẹ àfikún ọ̀rọ̀ eyikeyìí (bí o bá fẹ́)

source: Full Name
yo: Orúkọ lẹ́kùn-únrẹ́rẹ́

source: Email
yo: Í-mèlì

source: Phone Number
yo: Nọ́ńbà Fóònù

source: Amount (₦)
yo: Iye owó (₦)

source: Purpose
yo: Ìdí/Ète

source: Notes (Optional)
yo: Àkọsílẹ̀ (Bí o bá fẹ́)

source: Payment Method
yo: Ọ̀nà ìsanwó

source: Card Number
yo: Nọ́ńbà Káàdì

source: Expiry Date
yo: Ọjọ́ tó máa kú

source: Cardholder Name
yo: Orúkọ ẹni tó ni káàdì

source: Name as it appears on card
yo: Orúkọ gẹ́gẹ́ bí ó ṣe wà lórí káàdì

source: English
yo: Gẹ̀ẹ́sì

source: Arabic
yo: Lárúbáwá

source: French
yo: Faransé

source: Yoruba
yo: Yorùbá

source: Warning: Delete Account
yo: Ìkìlọ̀: Pa Àkánǹtì Rẹ

source: Are you sure you want to delete your JIBWIS profile? This action cannot be undone.
yo: Ṣé o dájú pé o fẹ́ pa ojú-ewé JIBWIS rẹ rẹ́? O kò ní lè yí ìpinnu yìí padà mọ́.

source: Yes, Delete My Account
yo: Bẹ́ẹ̀ ni, Pa Àkánǹtì mi rẹ́

source: Cancel
yo: Kagbuo

source: Edit Profile Details
yo: Ṣàtúnṣe Àkọsílẹ̀ Ara-ẹni

source: Organization & Payment
yo: Ètò Àjọ àti Ìsanwó

source: New
yo: Tuntun

source: From
yo: Láti

source: Dashboard
yo: Ojú-ewé Olórí

source: Directory
yo: Ìwé Orúkọ

source: Suspended
yo: Dídádúró

source: Account
yo: Àkánǹtì

source: Phone
yo: Nọ́ńbà fóònù

source: Message Selected
yo: Fi iṣẹ́ ránṣẹ́ sí àwọn tí a yàn

source: Personnel
yo: Òṣìṣẹ́

source: Position
yo: Ọkwa

source: Actions
yo: Ìgbésẹ̀

source: Active
yo: Ìmúṣiṣẹ́

source: View Profile
yo: Wo Àkọsílẹ̀

source: Subject
yo: Akòrí

source: Reason for suspending
yo: Ìdí fún dídádúró

source: Member Registration
yo: Ìforúkọsílẹ̀ Ọmọ-ẹgbẹ́

source: Navigation
yo: Ìṣàfihàn Ọ̀nà

source: Full Directory
yo: Ìwé Orúkọ lẹ́kùn-únrẹ́rẹ́

source: Unit Filters
yo: Ìṣàyẹ̀wò Ẹ̀ka

source: Member Status
yo: Ipò Ọmọ-ẹgbẹ́

source: All Members
yo: Gbogbo Ọmọ-ẹgbẹ́

source: Active Only
yo: Àwọn tó ń ṣiṣẹ́ nìkan

source: Position/Role
yo: Ọkwa/Iṣẹ́

source: Apply Filters
yo: Lo Ìṣàyẹ̀wò

source: Reset All
yo: Padà sí ìbẹ̀rẹ̀

source: Search by name or phone in your unit...
yo: Wá orúkọ tàbí fóònù nínú ẹ̀ka rẹ...

source: Search
yo: Wá

source: Results for
yo: Èsì fún

source: Account Info
yo: Ìròyìn Àkánǹtì

source: Management
yo: Ìṣàkóso

source: View File
yo: Wo Fáìlì

source: Suspend
yo: Dádúró

source: Activate
yo: Múṣiṣẹ́

source: Permanent Removal
yo: Ìparẹ́ Pátápáta

source: No members found in your unit matching this criteria.
yo: Kò sí ọmọ-ẹgbẹ́ kankan nínú ẹ̀ka rẹ tó bá ohun tó ò ń wá mu.

source: Violation of rules
yo: Yíyẹ òfin mọ́lẹ̀

source: WARNING: This will PERMANENTLY delete
yo: ÌKÌLỌ̀: Èyí yóò PA RẸ́ PÁTAPÁTA

source: from JIBWIS records. Proceed?
yo: kúrò nínú àkọsílẹ̀ JIBWIS. Ṣé kí a tẹ̀síwájú?

source: New Official Memo
yo: Ìwé Ìránṣẹ́ Iṣẹ́ Tuntun

source: Recipient
yo: Olùgbà

source: Enter memo title...
yo: Tẹ àkòrí ìwé ìránṣẹ́...

source: Message Body
yo: Àkóòpọ̀ Ìṣẹ́

source: Type your message here...
yo: Kọ ìṣẹ́ rẹ síbí yìí...

source: Send Message
yo: Fi Ìṣẹ́ Ránṣẹ́

source: To
yo: Sí

source: Change Username
yo: Yí Orúkọ-ìwọlé padà

source: Current Username:
yo: Orúkọ-ìwọlé lọ́wọ́lọ́wọ́:

source: Update Username
yo: Ṣàtúnṣe Orúkọ-ìwọlé

source: JIBWIS Nigeria Portal
yo: Ìkànnì JIBWIS Nàìjíríà

source: PORTAL
yo: ÌKÀNNÌ

source: Home
yo: Ilé

source: Logout
yo: Jáde

source: Login
yo: Wọlé

source: Join Us
yo: Dara pọ̀ mọ́ wa

source: Donate
yo: Ṣe Ìtọrẹ

source: Nigeria National Headquarters
yo: Olú-iléeṣẹ́ Orílẹ̀-èdè Nàìjíríà

source: Digital Management System | Developed for JIBWIS Nigeria
yo: Ètò Ìṣàkóso Orí-ìkànnì | A ṣe é fún JIBWIS Nàìjíríà

source: Paystack Transfer Balance
yo: Iwontunwonsi Gbigbe Paystack

source: Funds available for immediate disbursement.
yo: Owó wà nílẹ̀ láti san jáde lọ́gán.

source: Refresh Balance
yo: Ṣàtúnṣe Iwontunwonsi

source: Category Payroll
yo: Owó-oṣù Ìpín

source: Managing
yo: Ìṣàkóso

source: Search by name or unit/state...
yo: Wá orúkọ tàbí ẹ̀ka/ìpínlẹ̀...

source: Filter
yo: Sẹ́ ẹ

source: Scope
yo: Àyíká

source: Full Hierarchy (National)
yo: Gbogbo Ètò (Ti Orílẹ̀-èdè)

source: Restricted
yo: Ìfòfindè

source: Unit / Level
yo: Ẹ̀ka / Ipò

source: No matches found for
yo: Kò sí ohun tó bá mu fún

source: Selected
yo: A yàn án

source: Execute Disbursement
yo: Mú ìsanwó ṣẹ

source: Command Center
yo: Ibùdó Ìṣàkóso

source: Approve
yo: Fọwọ́ sí i

source: Bulk Payroll
yo: Owó-oṣù Ọ̀pọ̀lọpọ̀

source: My Inbox
yo: Àpótí Ìṣẹ́ mi

source: Recent Messages
yo: Àwọn Ìṣẹ́ Àìpẹ́

source: National Disciplinary Portal
yo: Ìkànnì Ìbáwí ti Orílẹ̀-èdè

source: High Clearance Only
yo: Àwọn adarí gíga nìkan

source: Reporter (Member)
yo: Olùjábọ̀ (Ọmọ-ẹgbẹ́)

source: Subject (Leader)
yo: Ẹni tí a fẹ́sùn kàn (Adarí)

source: Complaint Summary
yo: Àkópọ̀ Ìfẹ̀hònúhàn

source: Action
yo: Ìgbésẹ̀

source: Pending Review
yo: Ó ń dúró de àyẹ̀wò

source: Under Investigation
yo: Wọ́n ṣì ń ṣèwádìí

source: Resolved
yo: A ti yanjú rẹ̀

source: No active reports found.
yo: Kò sí àkọsílẹ̀ kankan.

source: Bank Transfer Payment
yo: Ìsanwó Gbigbe Báńkì

source: Contribution Summary
yo: Àkópọ̀ Ìtọrẹ

source: Your Name:
yo: Orúkọ Rẹ:

source: Amount:
yo: Iye owó:

source: Purpose:
yo: Ìdí/Ète:

source: Verification Reference:
yo: Ìtọ́kasí Ìmúdájú:

source: Bank Account Details
yo: Ìròyìn Àkánǹtì Báńkì

source: Bank Name:
yo: Orúkọ Báńkì:

source: Account Name:
yo: Orúkọ Àkánǹtì:

source: Account Number:
yo: Nọ́ńbà Àkánǹtì:

source: Reference Note:
yo: Àkọsílẹ̀ Ìtọ́kasí:

source: Important Instructions:
yo: Àwọn Ìlànà Pàtàkì:

source: Verification may take up to 24 hours to reflect.
yo: Ìmúdájú lè gba wákàtí mẹ́rìnlélógún.

source: Please keep your transfer receipt for your records.
yo: Jọ̀wọ́ tọ́jú ẹ̀rí ìsanwó rẹ fún àkọsílẹ̀.

source: For support, contact us at +234 800 000 0000.
yo: Fún ìrànlọ́wọ́, kàn sí wa lórí +234 800 000 0000.

source: Confirm Payment
yo: Fọwọ́ sí Ìsanwó

source: To confirm that you have made the transfer, please check the box below:
yo: Láti fìdí rẹ̀ múlẹ̀ pé o ti ṣe ìsanwó náà, jọ̀wọ́ yan àpótí ìsàlẹ̀ yìí:

source: I Have Sent the Money
yo: Mo ti fi owó náà ránṣẹ́

source: Go Back
yo: Padà sẹ́yìn

source: Card Payment
yo: Ìsanwó pẹ̀lú Káàdì

source: You will be redirected to a secure payment gateway to complete your transaction.
yo: A ó darí rẹ sí ibùdó ìsanwó tó ní ààbò láti parí ìṣẹ́ rẹ.

source: Reference Code:
yo: Nọ́ńbà Ìtọ́kasí:

source: Expiry (MM/YY)
yo: Ọjọ́ tó máa kú (Oṣù/Ọdún)

source: Name on Card
yo: Orúkọ lórí Káàdì

source: Your card details are securely encrypted. We do not store your full card information on our servers.
yo: Àwọn ìròyìn káàdì rẹ wà ní ààbò. A kì í tọ́jú gbogbo ìròyìn káàdì rẹ sórí ẹ̀rọ wa.

source: Pay ₦%(amt)s
yo: San ₦%(amt)s

source: Secure
yo: Ààbò

source: SSL Encrypted
yo: SSL Ààbò

source: PCI Compliant
yo: PCI Àbójútó

source: Izala Group
yo: Ẹgbẹ́ Izala

source: Contribution Confirmation
yo: Ìmúdájú Ìtọrẹ

source: Dear %(name)s,
yo: Olùfẹ́ %(name)s,

source: We are pleased to inform you that your contribution has been received.
yo: Inú wa dùn láti sọ fún ọ pé a ti gba ìtọrẹ rẹ.

source: Contribution Details:
yo: Ìròyìn Ìtọrẹ:

source: Payment Method:
yo: Ọ̀nà Ìsanwó:

source: Date:
yo: Ọjọ́:

source: Our sincere gratitude goes to everyone who contributes. Your support will greatly help the community.
yo: Ọpẹ́ wa tọkàntọkàn lọ sí ọ̀dọ̀ gbogbo ẹni tó ṣe ìtọrẹ. Ìrànlọ́wọ́ rẹ yóò ṣèrànwọ́ púpọ̀ fún àwùjọ.

source: If you have any questions, please reply to this email or contact us at:
yo: Bí o bá ní ìbéèrè eyikeyìí, jọ̀wọ́ fèsì sí í-mèlì yìí tàbí kàn sí wa ní:

source: Izala Group. All rights reserved.
yo: Ẹgbẹ́ Izala. Gbogbo ẹ̀tọ́ wà ní fífipamọ́.

source: Dedicated to serving the community
yo: Ti fìfẹ́ fún sísìn àwùjọ

source: Contribute Zakat/Sadaqah
yo: Ṣe Ìtọrẹ Zakāt/Sadaqah

source: Donor Information
yo: Ìròyìn Olùtọrẹ

source: Contribution Details
yo: Ìròyìn Ìtọrẹ

source: Minimum amount is ₦100
yo: Iye owó tí ó kéré jù ni ₦100

source: Use your bank debit/credit card
yo: Lo káàdì báńkì rẹ

source: Bank Transfer
yo: Gbigbe Báńkì

source: Transfer directly from your bank app
yo: Fi ránṣẹ́ láti inú ohun-èlò báńkì rẹ

source: Proceed to Contribute
yo: Tẹ̀síwájú láti ṣe Ìtọrẹ

source: Minimum donation amount is ₦100
yo: Iye owó ìtọrẹ tí ó kéré jù ni ₦100

source: Please select a payment method
yo: Jọ̀wọ́ yan ọ̀nà ìsanwó kan

source: Donation Records
yo: Àkọsílẹ̀ Ìtọrẹ

source: Add Manual Donation
yo: Fi ìtọrẹ kún un fúnra rẹ

source: Gateway Settings
yo: Ètò Ibùdó Ìsanwó

source: All Statuses
yo: Gbogbo Ipò

source: Pending
yo: Ó ń dúró

source: Completed
yo: A ti parí rẹ̀

source: Failed
yo: Kò yọrí sí rere

source: All Methods
yo: Gbogbo Ọ̀nà

source: Cash
yo: Owó gidi

source: Clear
yo: Pa á rẹ́

source: Total Donations:
yo: Àpapọ̀ Ìtọrẹ:

source: Donor
yo: Olùtọrẹ

source: Method
yo: Ọ̀nà

source: No email
yo: Kò sí í-mèlì

source: General
yo: Gbogbogbò

source: Donation Details
yo: Ìròyìn Ìtọrẹ

source: Donor:
yo: Olùtọrẹ:

source: Email:
yo: Í-mèlì:

source: Phone:
yo: Fóònù:

source: Method:
yo: Ọ̀nà:

source: Status:
yo: Ipò:

source: Notes:
yo: Àkọsílẹ̀:

source: None
yo: Kò sí

source: Transaction ID:
yo: ID Ìsanwó:

source: No donations found
yo: Kò sí ìtọrẹ kankan

source: Payment Pending
yo: Ìsanwó ń dúró

source: We are waiting to confirm your contribution
yo: À ń dúró láti fìdí ìtọrẹ rẹ múlẹ̀

source: Donor Name:
yo: Orúkọ Olùtọrẹ:

source: Reference Number:
yo: Nọ́ńbà Ìtọ́kasí:

source: What happens next?
yo: Kí ló máa ṣẹlẹ̀ tókàn?

source: We will verify the bank records for your payment.
yo: A ó ṣàyẹ̀wò àkọsílẹ̀ báńkì fún ìsanwó rẹ.

source: This process may take up to 24 hours.
yo: Ètò yìí lè gba wákàtí mẹ́rìnlélógún.

source: You will receive a confirmation email once the status is updated.
yo: O ó gba í-mèlì ìmúdájú gbà mọ́ bí a bá ti ṣe àtúnṣe rẹ̀.

source: If not confirmed within 2 days, please contact our support.
yo: Bí a kò bá fìdí rẹ̀ múlẹ̀ láàárín ọjọ́ méjì, jọ̀wọ́ kàn sí wa.

source: Make Another Contribution
yo: Ṣe Ìtọrẹ Míràn

source: Check Status
yo: Yẹ Ipò wò

source: For inquiries, contact us at
yo: Fún ìbéèrè, kàn sí wa ní

source: or
yo: tàbí

source: Check Payment Status
yo: Yẹ Ipò Ìsanwó wò

source: Checking payment status...
yo: À ń yẹ ipò ìsanwó wò...

source: Refresh
yo: Sọ dọ̀tun

source: Payment Successful!
yo: Ìsanwó yọrí sí rere!

source: Your payment was confirmed on
yo: A fìdí ìsanwó rẹ múlẹ̀ ní ọjọ́

source: View Confirmation
yo: Wo Ìmúdájú

source: We are still waiting to confirm your payment
yo: A ṣì ń dúró láti fìdí ìsanwó rẹ múlẹ̀

source: No Update Found
yo: Kò sí àtúnṣe kankan

source: There is no new information regarding your payment
yo: Kò sí ìròyìn tuntun nípa ìsanwó rẹ

source: Thank You!
yo: O ṣeun!

source: Your contribution was successful
yo: Ìtọrẹ rẹ yọrí sí rere

source: We will send a confirmation receipt to your email
yo: A ó fi ẹ̀rí ìsanwó ránṣẹ́ sí í-mèlì rẹ

source: once the transaction is fully processed
yo: nígbà tí a bá ti parí ìṣẹ́ náà pátápáta

source: Print Receipt
yo: Tẹ Ẹ̀rí Ìsanwó

source: If you have any questions regarding this contribution,
yo: Bí o bá ní ìbéèrè eyikeyìí nípa ìtọrẹ yìí,

source: please contact us at
yo: jọ̀wọ́ kàn sí wa ní

source: Authorize Disbursement
yo: Fọwọ́ sí Ìsanwó

source: Confirm Unit Payroll
yo: Fọwọ́ sí Owó-oṣù Ẹ̀ka

source: You are about to process payments for selected members of <strong>%(unit)s</strong>. This action will trigger bank transfers and cannot be reversed once executed.
yo: O fẹ́ ṣe ìsanwó fún àwọn ọmọ-ẹgbẹ́ tí a yàn nínú <strong>%(unit)s</strong>. Ìgbésẹ̀ yìí yóò bẹ̀rẹ̀ gbigbe báńkì, a kò sì lè yí i padà mọ́ tí a bá ti ṣe é.

source: Only 'Active' members selected in the table will be processed.
yo: Àwọn ọmọ-ẹgbẹ́ tó ń ṣiṣẹ́ ('Active') nìkan ni a ó san owó fún.

source: Review List
yo: Yẹ Àkọsílẹ̀ wò

source: Process Now
yo: Ṣe é nísinsìí

source: NAVIGATION
yo: ÌṢÀFIHÀN

source: Payroll History
yo: Ìtàn Owó-oṣù

source: SETTINGS
yo: ÈTÒ

source: My Profile
yo: Àkọsílẹ̀ mi

source: Updates
yo: Àtúnṣe

source: Welcome to our official portal. Stay tuned for live updates.
yo: Ẹ káàbọ̀ sí ìkànnì wa. Ẹ máa retí àwọn ìròyìn tuntun.

source: JIBWIS Digital Portal
yo: Ìkànnì JIBWIS

source: Unifying the Sunnah across Nigeria: Admin • Ulama • FAG
yo: Sísọ Sunnah di ọ̀kan káàkiri Nàìjíríà: Alákòóso • Ulama • FAG

source: Join Now
yo: Dara pọ̀ nísinsìí

source: Administration
yo: Ìṣàkóso

source: National to Ward level leadership coordination.
yo: Ìṣàkóso olórí láti orílẹ̀-èdè dé ipele ward.

source: Council of Ulama
yo: Ìgbìmọ̀ Ulama

source: Management of scholars and educational backgrounds.
yo: Ìṣàkóso àwọn onímọ̀ àti ẹ̀kọ́ wọn.

source: First Aid Group
yo: Ẹgbẹ́ Agbẹ́nigbẹ̀yì (First Aid)

source: Divisional, Detachment, and Unit leadership.
yo: Ìṣàkóso ìpín, detachment, àti ẹ̀ka.

source: Visit Us
yo: Wá bẹ̀ wá wò

source: JIBWIS National Headquarters,
yo: Olú-iléeṣẹ́ JIBWIS ti Orílẹ̀-èdè,

source: Kaduna, Kaduna State, Nigeria.
yo: Kaduna, Ìpínlẹ̀ Kaduna, Nàìjíríà.

source: Latest Announcements
yo: Àwọn Ìfilọ̀ Àìpẹ́

source: Read More
yo: Ka síwájú

source: JIBWIS Media Updates
yo: Ìròyìn Media JIBWIS

source: Share
yo: Pín in

source: Download
yo: Gba á sílẹ̀

source: Portal Login
yo: Ìwọlé sí Ìkànnì

source: Username
yo: Orúkọ-ìwọlé

source: Password
yo: Ọ̀rọ̀-asírí

source: Reset Your Password
yo: Yí Ọ̀rọ̀-asírí rẹ padà

source: Enter your email address below, and we'll email instructions for setting a new one.
yo: Tẹ àdírẹ́sì í-mèlì rẹ sí ìsàlẹ̀, a ó sì fi ìlànà láti ṣèdá tuntun ránṣẹ́ sí ọ.

source: Send Reset Email
yo: Fi Í-mèlì Ìtúnṣe Ránṣẹ́

source: Password Reset Complete
yo: Ìtúnṣe Ọ̀rọ̀-asírí ti parí

source: Your new password has been set. You may go ahead and log in now.
yo: A ti ṣètò ọ̀rọ̀-asírí tuntun rẹ. O lè wọlé nísinsìí.

source: Login to Portal
yo: Wọlé sí Ìkànnì

source: New Password
yo: Ọ̀rọ̀-asírí Tuntun

source: Please enter your new password below.
yo: Jọ̀wọ́ tẹ ọ̀rọ̀-asírí tuntun rẹ sí ìsàlẹ̀.

source: Reset Password
yo: Tún Ọ̀rọ̀-asírí Ṣe

source: This password reset link is invalid or has expired.
yo: Líǹkì ìtúnṣe ọ̀rọ̀-asírí yìí kò dára tàbí ó ti kú.

source: Request a new link
yo: Béèrè fún líǹkì tuntun

source: Check Your Email
yo: Yẹ Í-mèlì rẹ wò

source: We've emailed you instructions for setting your password. You should receive them shortly.
yo: A ti fi ìlànà láti ṣètò ọ̀rọ̀-asírí rẹ ránṣẹ́. O ó gbà á láìpẹ́.

source: If you don't receive an email, please ensure you've entered the address you registered with and check your spam folder.
yo: Bí o kò bá rí í-mèlì gbà, rí i dájú pé o tẹ àdírẹ́sì tó o lò láti forúkọsílẹ̀, kí o sì yẹ folda spam rẹ wò.

source: To initiate the password reset process for your JIBWIS account, click the link below:
yo: Láti bẹ̀rẹ̀ ètò ìtúnṣe ọ̀rọ̀-asírí fún àkánǹtì JIBWIS rẹ, tẹ líǹkì ìsàlẹ̀ yìí:

source: If clicking the link doesn't work, please copy and paste the URL into your browser.
yo: Bí títẹ líǹkì náà kò bá ṣiṣẹ́, jọ̀wọ́ dà á kọ sí inú ẹ̀rọ ìṣàwárí rẹ.

source: Disbursement Ledger
yo: Àkọsílẹ̀ Ìsanwó

source: New Disbursement
yo: Ìsanwó Tuntun

source: Date & Time
yo: Ọjọ́ & Àkókò

source: Paid
yo: A ti san án

source: No disbursement records found.
yo: Kò sí àkọsílẹ̀ ìsanwó kankan.

source: Pending Member Verifications
yo: Ìmúdájú Ọmọ-ẹgbẹ́ tó ń dúró

source: Unit/Jurisdiction
yo: Ẹ̀ka/Agbègbè

source: Registration Date
yo: Ọjọ́ Ìforúkọsílẹ̀

source: Bank:
yo: Báńkì:

source: Education:
yo: Ìwé-ẹ̀kọ́:

source: Position:
yo: Ọkwa:

source: Verified via Moniepoint/Paystack:
yo: A ti fìdí rẹ̀ múlẹ̀ láti Moniepoint/Paystack:

source: Account Validated
yo: Àkánǹtì tí a fọwọ́ sí

source: Account Not Validated
yo: Àkánǹtì tí a kò fọwọ́ sí

source: Upload Short Video
yo: Gbé fídíò kúkúrú sókè

source: Videos will auto-play on hover on the landing page. Recommended format: Vertical (9:16).
yo: Àwọn fídíò yóò bẹ̀rẹ̀ fúnra wọn nígbà tí a bá tẹ̀ ẹ́ lórí ojú-ewé àkọ́kọ́. Àwòrán tó dára jù: Oní-inṣì 9:16.

source: Publish Video
yo: Gbé fídíò jáde

source: Cancel and Return
yo: Kagbuo kí o sì padà
