Repository: Aburaihanai/izalams
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr

source: You must be assigned to a unit to send official memos.
ar: يجب تعيينك في وحدة لإرسال المذكرات الرسمية.
fr: Vous devez être affecté à une unité pour envoyer des mémos officiels.

source: Jurisdiction Error: You can only message members within your region.
ar: خطأ في النطاق الإداري: يمكنك مراسلة الأعضاء داخل منطقتك فقط.
fr: Erreur de Juridiction : Vous ne pouvez envoyer des messages qu'aux membres de votre région.

source: Yoruba
ar: اليوروبا

source: Igbo
ar: الإيجبو

source: Update your personal and organizational records
ar: تحديث بياناتك الشخصية والتنظيمية
fr: Mettre à jour vos dossiers personnels et organisationnels

source: When you update your bank info, our system verifies the name directly with your bank. Ensure the account number matches the bank selected.
ar: عند تحديث بياناتك البنكية، سيتحقق نظامنا من الاسم مباشرة مع بنكك. تأكد من تطابق رقم الحساب مع البنك المختار.
fr: Lorsque vous mettez à jour vos coordonnées bancaires, notre système vérifie le nom directement auprès de votre banque. Assurez-vous que le numéro de compte correspond à la banque sélectionnée.

source: Discard Changes
ar: إلغاء التغييرات
fr: Annuler les modifications

source: Save & Verify Records
ar: حفظ وتدقيق السجلات
fr: Enregistrer et vérifier les dossiers

source: Verifying...
ar: جاري التحقق...
fr: Vérification en cours...

source: Total
ar: الإجمالي

source: Received
ar: الوارد
fr: Reçus

source: Delete Permanent
ar: حذف نهائي
fr: Supprimer définitivement

source: Reply
ar: رد
fr: Répondre

source: Dismiss
ar: تجاهل
fr: Ignorer

source: Your official inbox is currently empty.
ar: صندوق الوارد الرسمي الخاص بك فارغ حالياً.
fr: Votre boîte de réception officielle est actuellement vide.

source: Run Paystack Verification
ar: تشغيل التحقق عبر Paystack
fr: Lancer la vérification Paystack

source: Global Identifier
ar: المعرف العالمي
fr: Identifiant Global

source: Changes made here are logged and visible to State/National auditors. Ensure all deactivations have documented reasons.
ar: يتم تسجيل التغييرات هنا وهي مرئية لمراجعي الحسابات المحليين والوطنيين. تأكد من توثيق أسباب جميع عمليات إلغاء التنشيط.
fr: Les modifications effectuées ici sont enregistrées et visibles par les auditeurs étatiques et nationaux. Assurez-vous que toutes les désactivations sont justifiées.

source: WARNING: This will permanently delete all data for
ar: تحذير: سيؤدي هذا إلى حذف جميع البيانات نهائياً لـ
fr: AVERTISSEMENT : Cela supprimera définitivement toutes les données de

source: Continue?
ar: استمرار؟
fr: Continuer ?

source: Enter reason for deactivation (e.g., Transfer, Disciplinary, Resignation):
ar: أدخل سبب إلغاء التنشيط (مثال: نقل، إجراء تأديبي، استقالة):
fr: Entrez le motif de la désactivation (ex : Transfert, Discipline, Démission) :

source: Manage unit personnel and broadcast notifications.
ar: إدارة أفراد الوحدة وبث الإشعارات.
fr: Gérer le personnel de l'unité et diffuser des notifications.

source: Export
ar: تصدير
fr: Exporter

source: Personnel in your unit will appear here.
ar: سيظهر أفراد وحدتك هنا.
fr: Le personnel de votre unité apparaîtra ici.

source: Unit Broadcast
ar: بث الوحدة
fr: Diffusion à l'unité

source: This message will be sent to the selected unit members.
ar: سيتم إرسال هذه الرسالة إلى أعضاء الوحدة المختارين.
fr: Ce message sera envoyé aux membres de l'unité sélectionnés.

source: e.g., Monthly Meeting
ar: مثال: الاجتماع الشهري
fr: ex : Réunion mensuelle

source: Send Broadcast
ar: إرسال البث
fr: Envoyer la diffusion

source: WARNING: Permanently delete
ar: تحذير: حذف نهائي لـ
fr: AVERTISSEMENT : Suppression définitive

source: This cannot be undone.
ar: لا يمكن التراجع عن هذا الإجراء.
fr: Cette action est irréversible.

source: Unit & Department
ar: الوحدة والقسم
fr: Unité et Département

source: Location Hierarchy
ar: التسلسل الهرمي للموقع
fr: Hiérarchie géographique

source: LGA
ar: منطقة الحكم المحلي
fr: Zone de gouvernement local (LGA)

source: Ward / Branch Name
ar: اسم الدائرة / الفرع
fr: Quartier / Nom de la branche

source: Submit for Leader Approval
ar: تقديم لاعتماد القائد
fr: Soumettre à l'approbation des responsables

source: Broadcasting Option
ar: خيار البث
fr: Option de diffusion

source: Send only to this individual
ar: إرسال لهذا الفرد فقط
fr: Envoyer uniquement à cet individu

source: All Admin in this Unit
ar: جميع الإداريين في هذه الوحدة
fr: Tous les administrateurs de cette unité

source: All Ulama in this Unit
ar: جميع العلماء في هذه الوحدة
fr: Tous les Ulémas de cette unité

source: Leave as 'Individual' to message only the user above, or select a group to message everyone in their category.
ar: اتركه 'فردي' لمراسلة المستخدم أعلاه فقط، أو اختر مجموعة لمراسلة الجميع في فئتهم.
fr: Laissez sur 'Individuel' pour n'envoyer un message qu'à l'utilisateur ci-dessus, ou sélectionnez un groupe pour envoyer un message à tous ceux de cette catégorie.

source: Tracking official broadcasts and replies.
ar: تتبع البث الرسمي والردود.
fr: Suivi des diffusions officielles et des réponses.

source: Sent
ar: المرسل
fr: Envoyé

source: Delivered
ar: تم التسليم
fr: Livré

source: Sent on
ar: أُرسل في
fr: Envoyé le

source: You haven't sent any memos yet.
ar: لم تقم بإرسال أي مذكرات بعد.
fr: Vous n'avez pas encore envoyé de mémos.

source: Approve
ar: اعتماد
fr: Approuver

source: Are you sure you want to REJECT and DELETE this application?
ar: هل أنت متأكد أنك تريد رفض وحذف هذا الطلب؟
fr: Êtes-vous sûr de vouloir REJETER et SUPPRIMER cette candidature ?

source: Reject Application
ar: رفض الطلب
fr: Rejeter la candidature

source: No pending requests. Your unit is fully approved.
ar: لا توجد طلبات معلقة. وحدتك معتمدة بالكامل.
fr: Aucune demande en attente. Votre unité est entièrement approuvée.

source: Manage unit personnel records.
ar: إدارة سجلات أفراد الوحدة.
fr: Gérer les dossiers du personnel de l'unité.

source: Unit communications.
ar: اتصالات الوحدة.
fr: Communications de l'unité.

source: Please use the <strong>reference code (%(ref)s)</strong> as the payment narration/memo.
ar: يرجى استخدام <strong>كود المرجع (%(ref)s)</strong> في وصف الدفع / المذكرة.

source: I confirm that I have sent ₦%(amt)s to the account stated above.
ar: أؤكد أنني قمت بإرسال ₦%(amt)s إلى الحساب المذكور أعلاه.

source: Dear %(name)s,
ar: عزيزي %(name)s،
fr: Cher %(name)s,

source: You are about to process payments for selected members of <strong>%(unit)s</strong>. This action will trigger bank transfers and cannot be reversed once executed.
ar: أنت على وشك معالجة المدفوعات للأعضاء المختارين في <strong>%(unit)s</strong>. سيؤدي هذا الإجراء إلى تفعيل التحويلات البنكية ولا يمكن التراجع عنه بمجرد التنفيذ.
fr: Vous êtes sur le point de traiter les paiements pour les membres sélectionnés de <strong>%(unit)s</strong>. Cette action déclenchera des virements bancaires et ne peut pas être annulée une fois exécutée.

source: Upload to Gallery
ar: رفع إلى المعرض
fr: Télécharger vers la galerie

source: Write something for your unit...
ar: اكتب شيئاً لوحدتك...
fr: Écrivez quelque chose pour votre unité...

source: This will only be visible to members of
ar: سيكون هذا مرئياً فقط لأعضاء
fr: Ceci ne sera visible que par les membres de

source: Post to Unit
ar: نشر في الوحدة
fr: Publier dans l'unité

source: Image Title
ar: عنوان الصورة
fr: Titre de l'image

source: e.g., Annual Conference
ar: مثال: المؤتمر السنوي
fr: ex : Conférence annuelle

source: Security Notice
ar: تنويه أمني
fr: Avis de sécurité

source: National Management Information System
ar: نظام إدارة المعلومات الوطني
fr: Système National de Gestion de l'Information

source: Your account may be awaiting leader approval from your assigned Ward/Unit.
ar: قد يكون حسابك في انتظار موافقة القائد من الدائرة/الوحدة المعين فيها.
fr: Votre compte est peut-être en attente de l'approbation d'un responsable de votre quartier ou unité.

source: Sign In
ar: تسجيل الدخول
fr: Se connecter

source: Forgot your security credentials?
ar: هل نسيت بيانات الأمان الخاصة بك؟
fr: Identifiants de sécurité oubliés ?

source: Submit Enrollment
ar: تقديم طلب التسجيل
fr: Soumettre l'inscription

source: Authorized Personnel Only.
ar: للموظفين المصرح لهم فقط.
fr: Personnel autorisé uniquement.

source: Video published to feed.
ar: تم نشر الفيديو في الموجز.
fr: Vidéo publiée dans le flux.

source: Username updated.
ar: تم تحديث اسم المستخدم.
fr: Nom d'utilisateur mis à jour.

source: Username already taken.
ar: اسم المستخدم محجوز بالفعل.
fr: Ce nom d'utilisateur est déjà pris.

source: Member
ar: العضو
fr: Membre

source: Amount
ar: المبلغ
fr: Montant

source: Reference
ar: المرجع
fr: Référence

source: Status
ar: الحالة
fr: Statut

source: Date
ar: التاريخ

source: Enter your full name
ar: أدخل اسمك الكامل
fr: Entrez votre nom complet

source: Enter your email address
ar: أدخل بريدك الإلكتروني
fr: Entrez votre adresse e-mail

source: Enter your phone number
ar: أدخل رقم هاتفك
fr: Entrez votre numéro de téléphone

source: e.g., Zakat
ar: مثلاً: زكاة
fr: ex: Zakat

source: Enter any additional notes (optional)
ar: أدخل أي ملاحظات إضافية (اختياري)
fr: Entrez des notes supplémentaires (facultatif)

source: Full Name
ar: الاسم الكامل
fr: Nom complet

source: Email
ar: البريد الإلكتروني

source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

source: Amount (₦)
ar: المبلغ (₦)
fr: Montant (₦)

source: Purpose
ar: الغرض
fr: Objectif

source: Notes (Optional)
ar: ملاحظات (اختياري)
fr: Notes (Facultatif)

source: Payment Method
ar: طريقة الدفع
fr: Mode de paiement

source: Card Number
ar: رقم البطاقة
fr: Numéro de carte

source: Expiry Date
ar: تاريخ الانتهاء
fr: Date d'expiration

source: CVV
ar: رمز التحقق (CVV)

source: Cardholder Name
ar: اسم صاحب البطاقة
fr: Nom du titulaire

source: Name as it appears on card
ar: الاسم كما يظهر على البطاقة
fr: Nom tel qu'il apparaît sur la carte

source: English
ar: الإنجليزية
fr: Anglais

source: Hausa
ar: الهوسا
fr: Haoussa

source: Arabic
ar: العربية
fr: Arabe

source: French
ar: الفرنسية
fr: Français

source: Warning: Delete Account
ar: تحذير: حذف الحساب
fr: Avertissement : Supprimer le compte

source: Are you sure you want to delete your JIBWIS profile? This action cannot be undone.
ar: هل أنت متأكد أنك تريد حذف ملفك الشخصي في جماعة إزالة؟ لا يمكن التراجع عن هذا الإجراء.
fr: Êtes-vous sûr de vouloir supprimer votre profil JIBWIS ? Cette action est irréversible.

source: Yes, Delete My Account
ar: نعم، احذف حسابي
fr: Oui, supprimer mon compte

source: Cancel
ar: إلغاء
fr: Annuler

source: Edit Profile Details
ar: تعديل بيانات الملف الشخصي
fr: Modifier les détails du profil

source: Organization & Payment
ar: التنظيم والدفع
fr: Organisation & Paiement

source: New
ar: جديد
fr: Nouveau

source: From
ar: من
fr: Du

source: Dashboard
ar: لوحة التحكم
fr: Tableau de bord

source: Directory
ar: الدليل
fr: Annuaire

source: Suspended
ar: المعلقون
fr: Suspendu

source: Account
ar: الحساب
fr: Compte

source: Phone
ar: الهاتف
fr: Téléphone

source: Message Selected
ar: مراسلة المختارين
fr: Message aux sélectionnés

source: Personnel
ar: الموظفين

source: Position
ar: المنصب
fr: Poste

source: Actions
ar: الإجراءات

source: Active
ar: نشط
fr: Actif

source: View Profile
ar: عرض الملف الشخصي
fr: Voir le profil

source: Subject
ar: الموضوع
fr: Sujet

source: Reason for suspending
ar: سبب التعليق
fr: Raison de la suspension

source: Member Registration
ar: تسجيل الأعضاء
fr: Inscription de membre

source: Navigation
ar: التنقل

source: Full Directory
ar: الدليل الكامل
fr: Annuaire complet

source: Unit Filters
ar: تصفية الوحدات
fr: Filtres d'unité

source: Member Status
ar: حالة العضو
fr: Statut du membre

source: All Members
ar: كل الأعضاء
fr: Tous les membres

source: Active Only
ar: النشطون فقط
fr: Actifs uniquement

source: Position/Role
ar: المنصب/الدور
fr: Poste/Rôle

source: Apply Filters
ar: تطبيق الفلاتر
fr: Appliquer les filtres

source: Reset All
ar: إعادة تعيين الكل
fr: Tout réinitialiser

source: Search by name or phone in your unit...
ar: بحث بالاسم أو الهاتف في وحدتك...
fr: Chercher par nom ou téléphone dans votre unité...

source: Search
ar: بحث
fr: Chercher

source: Results for
ar: نتائج
fr: Résultats pour

source: Account Info
ar: معلومات الحساب
fr: Infos compte

source: Management
ar: الإدارة
fr: Gestion

source: View File
ar: عرض الملف
fr: Voir le dossier

source: Suspend
ar: تعليق
fr: Suspendre

source: Activate
ar: تفعيل
fr: Activer

source: Permanent Removal
ar: إزالة دائمة
fr: Retrait permanent

source: No members found in your unit matching this criteria.
ar: لم يتم العثور على أعضاء في وحدتك يطابقون هذه المعايير.
fr: Aucun membre trouvé dans votre unité correspondant à ces critères.

source: Violation of rules
ar: مخالفة القوانين
fr: Violation des règles

source: WARNING: This will PERMANENTLY delete
ar: تحذير: هذا سيحذف نهائياً
fr: ATTENTION : Ceci supprimera DÉFINITIVEMENT

source: from JIBWIS records. Proceed?
ar: من سجلات جماعة إزالة. هل تستمر؟
fr: des dossiers JIBWIS. Continuer ?

source: New Official Memo
ar: مذكرة رسمية جديدة
fr: Nouveau mémo officiel

source: Recipient
ar: المستلم
fr: Destinataire

source: Enter memo title...
ar: أدخل عنوان المذكرة...
fr: Entrez le titre du mémo...

source: Message Body
ar: نص الرسالة
fr: Corps du message

source: Type your message here...
ar: اكتب رسالتك هنا...
fr: Tapez votre message ici...

source: Send Message
ar: إرسال الرسالة
fr: Envoyer le message

source: To
ar: إلى
fr: Au

source: Change Username
ar: تغيير اسم المستخدم
fr: Changer le nom d'utilisateur

source: Current Username:
ar: اسم المستخدم الحالي:
fr: Nom d'utilisateur actuel :

source: Update Username
ar: تحديث اسم المستخدم
fr: Mettre à jour le nom d'utilisateur

source: JIBWIS Nigeria Portal
ar: بوابة جماعة إزالة نيجيريا
fr: Portail JIBWIS Nigeria

source: PORTAL
ar: البوابة
fr: PORTAIL

source: Home
ar: الرئيسية
fr: Accueil

source: Logout
ar: تسجيل الخروج
fr: Déconnexion

source: Login
ar: تسجيل الدخول
fr: Connexion

source: Join Us
ar: انضم إلينا
fr: Rejoignez-nous

source: Donate
ar: تبرع
fr: Faire un don

source: Nigeria National Headquarters
ar: المقر الوطني بنيجيريا
fr: Siège National du Nigeria

source: Digital Management System | Developed for JIBWIS Nigeria
ar: نظام الإدارة الرقمية | تم تطويره لجماعة إزالة نيجيريا
fr: Système de Gestion Numérique | Développé pour JIBWIS Nigeria

source: Paystack Transfer Balance
ar: رصيد تحويلات باي ستاك
fr: Solde des transferts Paystack

source: Funds available for immediate disbursement.
ar: الأموال المتاحة للصرف الفوري.
fr: Fonds disponibles pour décaissement immédiat.

source: Refresh Balance
ar: تحديث الرصيد
fr: Actualiser le solde

source: Category Payroll
ar: رواتب الفئة
fr: Paie par catégorie

source: Managing
ar: إدارة
fr: Gestion de

source: Search by name or unit/state...
ar: بحث بالاسم أو الوحدة/الولاية...
fr: Chercher par nom ou unité/état...

source: Filter
ar: تصفية
fr: Filtrer

source: Scope
ar: النطاق
fr: Portée

source: Full Hierarchy (National)
ar: الهيكل الكامل (وطني)
fr: Hiérarchie complète (National)

source: Restricted
ar: مقيد
fr: Restreint

source: Unit / Level
ar: الوحدة / المستوى
fr: Unité / Niveau

source: No matches found for
ar: لم يتم العثور على نتائج لـ
fr: Aucune correspondance trouvée pour

source: Selected
ar: مختار
fr: Sélectionné

source: Execute Disbursement
ar: تنفيذ الصرف
fr: Exécuter le décaissement

source: Command Center
ar: مركز القيادة
fr: Centre de commandement

source: Bulk Payroll
ar: الرواتب الجماعية
fr: Paie groupée

source: My Inbox
ar: صندوق الوارد
fr: Ma boîte de réception

source: Recent Messages
ar: الرسائل الأخيرة
fr: Messages récents

source: National Disciplinary Portal
ar: البوابة الوطنية للتأديب
fr: Portail disciplinaire national

source: High Clearance Only
ar: تصريح عالي فقط
fr: Accès restreint (Haute sécurité)

source: Reporter (Member)
ar: المُبلغ (عضو)
fr: Signaleur (Membre)

source: Subject (Leader)
ar: الموضوع (قائد)
fr: Sujet (Responsable)

source: Complaint Summary
ar: ملخص الشكوى
fr: Résumé de la plainte

source: Action
ar: إجراء

source: Pending Review
ar: قيد المراجعة
fr: En attente d'examen

source: Under Investigation
ar: قيد التحقيق
fr: Sous enquête

source: Resolved
ar: تم الحل
fr: Résolu

source: No active reports found.
ar: لم يتم العثور على تقارير نشطة.
fr: Aucun rapport actif trouvé.

source: Bank Transfer Payment
ar: الدفع بالتحويل البنكي
fr: Paiement par virement bancaire

source: Contribution Summary
ar: ملخص المساهمة
fr: Résumé de la contribution

source: Your Name:
ar: اسمك:
fr: Votre nom :

source: Amount:
ar: المبلغ:
fr: Montant :

source: Purpose:
ar: الغرض:
fr: Objectif :

source: Verification Reference:
ar: مرجع التحقق:
fr: Référence de vérification :

source: Bank Account Details
ar: تفاصيل الحساب البنكي
fr: Détails du compte bancaire

source: Bank Name:
ar: اسم البنك:
fr: Nom de la banque :

source: Account Name:
ar: اسم الحساب:
fr: Nom du compte :

source: Account Number:
ar: رقم الحساب:
fr: Numéro de compte :

source: Reference Note:
ar: ملاحظة المرجع:
fr: Note de référence :

source: Important Instructions:
ar: تعليمات هامة:
fr: Instructions importantes :

source: Verification may take up to 24 hours to reflect.
ar: قد يستغرق التحقق ما يصل إلى 24 ساعة ليظهر.
fr: La vérification peut prendre jusqu'à 24 heures avant d'apparaître.

source: Please keep your transfer receipt for your records.
ar: يرجى الاحتفاظ بإيصال التحويل لسجلاتك.
fr: Veuillez conserver votre reçu de virement pour vos dossiers.

source: For support, contact us at +234 800 000 0000.
ar: للدعم، اتصل بنا على 0000 000 800 234+.
fr: Pour toute assistance, contactez-nous au +234 800 000 0000.

source: Confirm Payment
ar: تأكيد الدفع
fr: Confirmer le paiement

source: To confirm that you have made the transfer, please check the box below:
ar: لتأكيد أنك قمت بالتحويل، يرجى تفعيل المربع أدناه:
fr: Pour confirmer que vous avez effectué le virement, veuillez cocher la case ci-dessous :

source: I Have Sent the Money
ar: لقد أرسلت المال
fr: J'ai envoyé l'argent

source: Go Back
ar: الرجوع
fr: Retourner

source: Card Payment
ar: الدفع بالبطاقة
fr: Paiement par carte

source: You will be redirected to a secure payment gateway to complete your transaction.
ar: سيتم توجيهك إلى بوابة دفع آمنة لإكمال المعاملة.
fr: Vous allez être redirigé vers une passerelle de paiement sécurisée pour terminer votre transaction.

source: Reference Code:
ar: رمز المرجع:
fr: Code de référence :

source: Expiry (MM/YY)
ar: الانتهاء (ش/س)
fr: Expiration (MM/AA)

source: Name on Card
ar: الاسم على البطاقة
fr: Nom sur la carte

source: Your card details are securely encrypted. We do not store your full card information on our servers.
ar: تفاصيل بطاقتك مشفرة بشكل آمن. نحن لا نخزن معلومات بطاقتك الكاملة على خوادمنا.
fr: Les détails de votre carte sont cryptés de manière sécurisée. Nous ne stockons pas vos informations complètes sur nos serveurs.

source: Pay ₦%(amt)s
ar: دفع ₦%(amt)s
fr: Payer ₦%(amt)s

source: Secure
ar: آمن
fr: Sécurisé

source: SSL Encrypted
ar: مشفر بـ SSL
fr: Crypté par SSL

source: PCI Compliant
ar: متوافق مع PCI
fr: Conforme PCI

source: Izala Group
ar: جماعة إزالة
fr: Groupe Izala

source: Contribution Confirmation
ar: تأكيد المساهمة
fr: Confirmation de contribution

source: We are pleased to inform you that your contribution has been received.
ar: يسعدنا إبلاغك بأنه قد تم استلام مساهمتك.
fr: Nous avons le plaisir de vous informer que votre contribution a été reçue.

source: Contribution Details:
ar: تفاصيل المساهمة:
fr: Détails de la contribution :

source: Payment Method:
ar: طريقة الدفع:
fr: Mode de paiement :

source: Date:
ar: التاريخ:

source: Our sincere gratitude goes to everyone who contributes. Your support will greatly help the community.
ar: خالص شكرنا لكل من يساهم. دعمكم سيساعد المجتمع بشكل كبير.
fr: Notre sincère gratitude va à tous ceux qui contribuent. Votre soutien aidera grandement la communauté.

source: If you have any questions, please reply to this email or contact us at:
ar: إذا كان لديك أي أسئلة، يرجى الرد على هذا البريد الإلكتروني أو الاتصال بنا على:
fr: Si vous avez des questions, veuillez répondre à cet e-mail ou nous contacter à :

source: Izala Group. All rights reserved.
ar: جماعة إزالة. جميع الحقوق محفوظة.
fr: Groupe Izala. Tous droits réservés.

source: Dedicated to serving the community
ar: مكرسون لخدمة المجتمع
fr: Dédié au service de la communauté

source: Contribute Zakat/Sadaqah
ar: المساهمة بزكاة أو صدقة
fr: Contribuer (Zakat/Sadaqah)

source: Donor Information
ar: معلومات المتبرع
fr: Informations du donateur

source: Contribution Details
ar: تفاصيل المساهمة
fr: Détails de la contribution

source: Minimum amount is ₦100
ar: الحد الأدنى للمبلغ هو ₦100
fr: Le montant minimum est de ₦100

source: Use your bank debit/credit card
ar: استخدم بطاقة الخصم/الائتمان البنكية
fr: Utilisez votre carte bancaire débit/crédit

source: Bank Transfer
ar: تحويل بنكي
fr: Virement bancaire

source: Transfer directly from your bank app
ar: التحويل مباشرة من تطبيق البنك الخاص بك
fr: Transférez directement depuis votre application bancaire

source: Proceed to Contribute
ar: المتابعة للمساهمة
fr: Procéder à la contribution

source: Minimum donation amount is ₦100
ar: الحد الأدنى لمبلغ التبرع هو ₦100
fr: Le montant minimum du don est de ₦100

source: Please select a payment method
ar: يرجى اختيار طريقة الدفع
fr: Veuillez sélectionner un mode de paiement

source: Donation Records
ar: سجلات التبرعات
fr: Archives des dons

source: Add Manual Donation
ar: إضافة تبرع يدوي
fr: Ajouter un don manuel

source: Gateway Settings
ar: إعدادات البوابة
fr: Paramètres de la passerelle

source: All Statuses
ar: جميع الحالات
fr: Tous les statuts

source: Pending
ar: قيد الانتظار
fr: En attente

source: Completed
ar: مكتمل
fr: Terminé

source: Failed
ar: فاشل
fr: Échoué

source: All Methods
ar: جميع الطرق
fr: Toutes les méthodes

source: Cash
ar: نقداً
fr: Espèces

source: Clear
ar: مسح
fr: Effacer

source: Total Donations:
ar: إجمالي التبرعات:
fr: Total des dons :

source: Donor
ar: المتبرع
fr: Donateur

source: Method
ar: الطريقة
fr: Méthode

source: No email
ar: لا يوجد بريد
fr: Pas d'e-mail

source: General
ar: عام
fr: Général

source: Donation Details
ar: تفاصيل التبرع
fr: Détails du don

source: Donor:
ar: المتبرع:
fr: Donateur :

source: Email:
ar: البريد الإلكتروني:

source: Phone:
ar: الهاتف:
fr: Tél :

source: Method:
ar: الطريقة:
fr: Méthode :

source: Status:
ar: الحالة:
fr: Statut :

source: Notes:
ar: ملاحظات:

source: None
ar: لا يوجد
fr: Aucun

source: Transaction ID:
ar: رقم المعاملة:
fr: ID de transaction :

source: No donations found
ar: لم يتم العثور على تبرعات
fr: Aucun don trouvé

source: Payment Pending
ar: الدفع قيد الانتظار
fr: Paiement en attente

source: We are waiting to confirm your contribution
ar: نحن ننتظر لتأكيد مساهمتك
fr: Nous attendons de confirmer votre contribution

source: Donor Name:
ar: اسم المتبرع:
fr: Nom du donateur :

source: Reference Number:
ar: رقم المرجع:
fr: Numéro de référence :

source: What happens next?
ar: ماذا يحدث بعد ذلك؟
fr: Que se passe-t-il ensuite ?

source: We will verify the bank records for your payment.
ar: سنتحقق من السجلات البنكية لدفعتك.
fr: Nous vérifierons les relevés bancaires pour votre paiement.

source: This process may take up to 24 hours.
ar: قد تستغرق هذه العملية ما يصل إلى 24 ساعة.
fr: Ce processus peut prendre jusqu'à 24 heures.

source: You will receive a confirmation email once the status is updated.
ar: ستتلقى بريداً إلكترونياً للتأكيد بمجرد تحديث الحالة.
fr: Vous recevrez un e-mail de confirmation une fois le statut mis à jour.

source: If not confirmed within 2 days, please contact our support.
ar: إذا لم يتم التأكيد خلال يومين، يرجى الاتصال بالدعم.
fr: Si ce n'est pas confirmé sous 2 jours, veuillez contacter notre support.

source: Make Another Contribution
ar: القيام بمساهمة أخرى
fr: Faire une autre contribution

source: Check Status
ar: التحقق من الحالة
fr: Vérifier le statut

source: For inquiries, contact us at
ar: للاستفسارات، اتصل بنا على
fr: Pour toute question, contactez-nous à

source: or
ar: أو
fr: ou
