Repository: Aburaihanai/izalams
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ar, fr

source: Check Payment Status
ar: التحقق من حالة الدفع
fr: Vérifier le statut du paiement

source: Checking payment status...
ar: جاري التحقق من حالة الدفع...
fr: Vérification du statut du paiement...

source: Refresh
ar: تحديث
fr: Actualiser

source: Payment Successful!
ar: تم الدفع بنجاح!
fr: Paiement réussi !

source: Your payment was confirmed on
ar: تم تأكيد دفعتك بتاريخ
fr: Votre paiement a été confirmé le

source: View Confirmation
ar: عرض التأكيد
fr: Voir la confirmation

source: We are still waiting to confirm your payment
ar: ما زلنا ننتظر لتأكيد دفعتك
fr: Nous attendons toujours la confirmation de votre paiement

source: No Update Found
ar: لم يتم العثور على تحديث
fr: Aucune mise à jour trouvée

source: There is no new information regarding your payment
ar: لا توجد معلومات جديدة بخصوص دفعتك
fr: Il n'y a pas de nouvelles informations concernant votre paiement

source: Thank You!
ar: شكراً لك!
fr: Merci !

source: Your contribution was successful
ar: تمت مساهمتك بنجاح
fr: Votre contribution a été effectuée avec succès

source: We will send a confirmation receipt to your email
ar: سنرسل إيصال تأكيد إلى بريدك الإلكتروني
fr: Nous enverrons un reçu de confirmation à votre e-mail

source: once the transaction is fully processed
ar: بمجرد معالجة المعاملة بالكامل
fr: une fois que la transaction sera entièrement traitée

source: Print Receipt
ar: طباعة الإيصال
fr: Imprimer le reçu

source: If you have any questions regarding this contribution,
ar: إذا كان لديك أي أسئلة بخصوص هذه المساهمة،
fr: Si vous avez des questions concernant cette contribution,

source: please contact us at
ar: يرجى الاتصال بنا على
fr: veuillez nous contacter à

source: Authorize Disbursement
ar: تفويض الصرف
fr: Autoriser le décaissement

source: Confirm Unit Payroll
ar: تأكيد رواتب الوحدة
fr: Confirmer la paie de l'unité

source: Only 'Active' members selected in the table will be processed.
ar: سيتم معالجة الأعضاء 'النشطين' المختارين في الجدول فقط.
fr: Seuls les membres 'Actifs' sélectionnés dans le tableau seront traités.

source: Review List
ar: مراجعة القائمة
fr: Réviser la liste

source: Process Now
ar: المعالجة الآن
fr: Traiter maintenant

source: NAVIGATION
ar: التنقل

source: Payroll History
ar: سجل الرواتب
fr: Historique de paie

source: SETTINGS
ar: الإعدادات
fr: PARAMÈTRES

source: My Profile
ar: ملفي الشخصي
fr: Mon profil

source: Updates
ar: تحديثات
fr: Mises à jour

source: Welcome to our official portal. Stay tuned for live updates.
ar: مرحباً بكم في بوابتنا الرسمية. ترقبوا التحديثات المباشرة.
fr: Bienvenue sur notre portail officiel. Restez à l'écoute pour les mises à jour en direct.

source: JIBWIS Digital Portal
ar: بوابة جماعة إزالة الرقمية
fr: Portail Numérique JIBWIS

source: Unifying the Sunnah across Nigeria: Admin • Ulama • FAG
ar: توحيد السنة عبر نيجيريا: الإدارة • العلماء • الإسعاف
fr: Unifier la Sunnah à travers le Nigeria : Admin • Ulama • FAG

source: Join Now
ar: انضم الآن
fr: S'inscrire

source: Administration
ar: الإدارة

source: National to Ward level leadership coordination.
ar: تنسيق القيادة من المستوى الوطني إلى مستوى الدائرة.
fr: Coordination du leadership du niveau national au quartier.

source: Council of Ulama
ar: مجلس العلماء
fr: Conseil des Ulémas

source: Management of scholars and educational backgrounds.
ar: إدارة العلماء والخلفيات التعليمية.
fr: Gestion des savants et des parcours éducatifs.

source: First Aid Group
ar: منظمة الإسعاف
fr: Groupe de premiers secours

source: Divisional, Detachment, and Unit leadership.
ar: قيادة الشعب والمفارز والوحدات.
fr: Direction de division, de détachement et d'unité.

source: Visit Us
ar: زورونا
fr: Nous rendre visite

source: JIBWIS National Headquarters,
ar: المقر الوطني لجماعة إزالة،
fr: Siège National JIBWIS,

source: Kaduna, Kaduna State, Nigeria.
ar: كادونا، ولاية كادونا، نيجيريا.
fr: Kaduna, État de Kaduna, Nigeria.

source: Latest Announcements
ar: آخر الإعلانات
fr: Dernières annonces

source: Read More
ar: اقرأ المزيد
fr: Lire la suite

source: JIBWIS Media Updates
ar: تحديثات إعلام جماعة إزالة
fr: Mises à jour médias JIBWIS

source: Share
ar: مشاركة
fr: Partager

source: Download
ar: تحميل
fr: Télécharger

source: Portal Login
ar: تسجيل دخول البوابة
fr: Connexion au portail

source: Username
ar: اسم المستخدم
fr: Nom d'utilisateur

source: Password
ar: كلمة السر
fr: Mot de passe

source: Reset Your Password
ar: إعادة تعيين كلمة السر
fr: Réinitialisez votre mot de passe

source: Enter your email address below, and we'll email instructions for setting a new one.
ar: أدخل بريدك الإلكتروني أدناه، وسنرسل لك تعليمات لتعيين كلمة سر جديدة.
fr: Entrez votre adresse e-mail ci-dessous, et nous vous enverrons des instructions pour en créer un nouveau.

source: Send Reset Email
ar: إرسال بريد إعادة التعيين
fr: Envoyer l'e-mail de réinitialisation

source: Password Reset Complete
ar: اكتمل إعادة تعيين كلمة السر
fr: Réinitialisation du mot de passe terminée

source: Your new password has been set. You may go ahead and log in now.
ar: تم تعيين كلمة سر جديدة. يمكنك المتابعة وتسجيل الدخول الآن.
fr: Votre nouveau mot de passe a été défini. Vous pouvez maintenant vous connecter.

source: Login to Portal
ar: الدخول إلى البوابة
fr: Se connecter au portail

source: New Password
ar: كلمة سر جديدة
fr: Nouveau mot de passe

source: Please enter your new password below.
ar: يرجى إدخال كلمة السر الجديدة أدناه.
fr: Veuillez entrer votre nouveau mot de passe ci-dessous.

source: Reset Password
ar: إعادة تعيين كلمة السر
fr: Réinitialiser le mot de passe

source: This password reset link is invalid or has expired.
ar: رابط إعادة تعيين كلمة السر هذا غير صالح أو انتهت صلاحيته.
fr: Ce lien de réinitialisation de mot de passe est invalide ou a expiré.

source: Request a new link
ar: طلب رابط جديد
fr: Demander un nouveau lien

source: Check Your Email
ar: تفقد بريدك الإلكتروني
fr: Vérifiez vos e-mails

source: We've emailed you instructions for setting your password. You should receive them shortly.
ar: لقد أرسلنا لك تعليمات لتعيين كلمة السر. ستصلك قريباً.
fr: Nous vous avons envoyé des instructions par e-mail pour définir votre mot de passe. Vous devriez les recevoir sous peu.

source: If you don't receive an email, please ensure you've entered the address you registered with and check your spam folder.
ar: إذا لم تستلم بريداً، يرجى التأكد من إدخال العنوان الذي سجلت به وتفقد مجلد البريد المزعج.
fr: Si vous ne recevez pas d'e-mail, assurez-vous d'avoir saisi l'adresse avec laquelle vous vous êtes inscrit et vérifiez votre dossier de courriers indésirables.

source: To initiate the password reset process for your JIBWIS account, click the link below:
ar: لبدء عملية إعادة تعيين كلمة السر لحسابك في جماعة إزالة، اضغط على الرابط أدناه:
fr: Pour lancer le processus de réinitialisation de mot de passe de votre compte JIBWIS, cliquez sur le lien ci-dessous :

source: If clicking the link doesn't work, please copy and paste the URL into your browser.
ar: إذا كان الضغط على الرابط لا يعمل، يرجى نسخ ولصق الرابط في متصفحك.
fr: Si le clic sur le lien ne fonctionne pas, veuillez copier et coller l'URL dans votre navigateur.

source: Disbursement Ledger
ar: سجل الصرف
fr: Registre des décaissements

source: New Disbursement
ar: عملية صرف جديدة
fr: Nouveau décaissement

source: Date & Time
ar: التاريخ والوقت
fr: Date & Heure

source: Paid
ar: تم الدفع
fr: Payé

source: No disbursement records found.
ar: لم يتم العثور على سجلات صرف.
fr: Aucun enregistrement de décaissement trouvé.

source: Pending Member Verifications
ar: عمليات توثيق الأعضاء المعلقة
fr: Vérifications de membres en attente

source: Unit/Jurisdiction
ar: الوحدة/النطاق
fr: Unité/Juridiction

source: Registration Date
ar: تاريخ التسجيل
fr: Date d'inscription

source: Bank:
ar: البنك:
fr: Banque :

source: Education:
ar: التعليم:
fr: Éducation :

source: Position:
ar: المنصب:
fr: Poste :

source: Verified via Moniepoint/Paystack:
ar: تم التحقق عبر Moniepoint/Paystack:
fr: Vérifié via Moniepoint/Paystack :

source: Account Validated
ar: تم تفعيل الحساب
fr: Compte validé

source: Account Not Validated
ar: لم يتم تفعيل الحساب
fr: Compte non validé

source: Upload Short Video
ar: تحميل فيديو قصير
fr: Télécharger une courte vidéo

source: Videos will auto-play on hover on the landing page. Recommended format: Vertical (9:16).
ar: سيتم تشغيل مقاطع الفيديو تلقائياً عند التمرير عليها في الصفحة الرئيسية. التنسيق الموصى به: عمودي (9:16).
fr: Les vidéos seront lues automatiquement au survol sur la page d'accueil. Format recommandé : Vertical (9:16).

source: Publish Video
ar: نشر الفيديو
fr: Publier la vidéo

source: Cancel and Return
ar: إلغاء والعودة
fr: Annuler et retourner
