Repository: Aburaihanai/izalams
Catalog: locale/ha/LC_MESSAGES/django.po
Languages: ha

source: You must be assigned to a unit to send official memos.
ha: Dole ne a sanya ka a wani sashe kafin ka iya aika saƙon memo na hukuma.

source: Jurisdiction Error: You can only message members within your region.
ha: Kuskuren Hurumi: Za ka iya aika saƙo ne kawai ga mambobi da ke cikin yankinka.

source: Yoruba
ha: Yarabanci

source: Igbo
ha: Inyamuranci

source: Update your personal and organizational records
ha: Sabunta bayanan kanka da na ƙungiya

source: When you update your bank info, our system verifies the name directly with your bank. Ensure the account number matches the bank selected.
ha: Idan ka sabunta bayanan banki, tsarinmu zai tabbatar da sunanka kai tsaye daga bankinka. Tabbatar lambar asusun ta dace da bankin da aka zaɓa.

source: Discard Changes
ha: Soke Canje-canje

source: Save & Verify Records
ha: Ajiye Kuma Tabbatar da Bayanai

source: Verifying...
ha: Ana tantancewa...

source: Total
ha: Jimilla

source: Received
ha: Saƙonni da aka karba

source: Delete Permanent
ha: Goge Gaba ɗaya

source: Reply
ha: Ba da amsa

source: Dismiss
ha: Korewa

source: Your official inbox is currently empty.
ha: Sashin saƙonni na hukuma babu komai a ciki yanzu.

source: Run Paystack Verification
ha: Gudanar da Tabbatarwar Paystack

source: Global Identifier
ha: Shaidar Shiga ta Duniya

source: Changes made here are logged and visible to State/National auditors. Ensure all deactivations have documented reasons.
ha: Duk canje-canjen da aka yi a nan ana adana su kuma masu binciken kudi na Jiha/Ƙasa na iya gani. Tabbatar dukkan dakatarwa suna da dalilai takaitattu.

source: WARNING: This will permanently delete all data for
ha: GARADI: Wannan zai goge dukkan bayanan

source: Continue?
ha: A ci gaba?

source: Enter reason for deactivation (e.g., Transfer, Disciplinary, Resignation):
ha: Shigar da dalilin dakatarwa (misali, Canjin wurin aiki, Hukunci, Murabus):

source: Manage unit personnel and broadcast notifications.
ha: Gudanar da ma'aikatan sashe da aika saƙonni.

source: Export
ha: Fitar da Bayanai

source: Personnel in your unit will appear here.
ha: Ma'aikatan da ke sashinka za su bayyana a nan.

source: Unit Broadcast
ha: Saƙon Sashe na Gaba ɗaya

source: This message will be sent to the selected unit members.
ha: Wannan saƙon za a aika shi ga mambobin sashin da aka zaɓa.

source: e.g., Monthly Meeting
ha: misali, Taron Wata-wata

source: Send Broadcast
ha: Aika Saƙon zuwa ga kowa

source: WARNING: Permanently delete
ha: GARADI: Goge gaba ɗaya

source: This cannot be undone.
ha: Wannan ba za a iya canzawa ba.

source: Unit & Department
ha: Sashe da Sashen Aiki

source: Location Hierarchy
ha: Tsarin Wuri

source: LGA
ha: Ƙaramar Hukuma

source: Ward / Branch Name
ha: Mazaɓa / Sunan Reshe

source: Submit for Leader Approval
ha: Tura don Amincewar Shugaba

source: Broadcasting Option
ha: Zaɓin Aika Saƙon Gaba ɗaya

source: Send only to this individual
ha: Aika wa wannan mutumin kawai

source: All Admin in this Unit
ha: Dukkan Masu Gudanarwa (Admin) a wannan Sashen

source: All Ulama in this Unit
ha: Dukkan Malamai (Ulama) a wannan Sashen

source: Leave as 'Individual' to message only the user above, or select a group to message everyone in their category.
ha: Bar shi a matsayin 'Mutum ɗaya' don aika saƙo ga mutumin da ke sama kawai, ko ka zaɓi rukunin mutane don aika saƙo ga kowa a rukuninsu.

source: Tracking official broadcasts and replies.
ha: Bibiyar saƙonni da martani na hukuma.

source: Sent
ha: Wadanda aka aika

source: Delivered
ha: An isar

source: Sent on
ha: An aika a ranar

source: You haven't sent any memos yet.
ha: Ba ka aika wani saƙon memo ba tukuna.

source: Are you sure you want to REJECT and DELETE this application?
ha: Shin kana da tabbacin kana son KIN AMINCEWA da kuma GOGE wannan takardar neman shiga?

source: Reject Application
ha: Ki amincewa da takardar

source: No pending requests. Your unit is fully approved.
ha: Babu sauran buƙatun da ke jira. An riga an amince da sashinka gaba ɗaya.

source: Manage unit personnel records.
ha: Gudanar da bayanan ma'aikatan sashe.

source: Unit communications.
ha: Sadarwar sashe.

source: Upload to Gallery
ha: Loda hoto zuwa kundin hotuna

source: Write something for your unit...
ha: Rubuta wani abu don sashinka...

source: This will only be visible to members of
ha: Mambobin wannan sashen ne kawai za su iya ganin wannan

source: Post to Unit
ha: Tura wa Sashe

source: Image Title
ha: Sunan Hoto

source: e.g., Annual Conference
ha: misali, Taron Shekara-shekara

source: Security Notice
ha: Sanarwar Tsaro

source: National Management Information System
ha: Tsarin Gudanar da Bayanai na Ƙasa

source: Your account may be awaiting leader approval from your assigned Ward/Unit.
ha: Asusunka na iya kasancewa yana jiran amincewar shugaba daga Mazaɓa ko Sashinka.

source: Sign In
ha: Shiga

source: Forgot your security credentials?
ha: Ka manta bayanan tsaronka?

source: Submit Enrollment
ha: Tura Buƙatar Shiga

source: Authorized Personnel Only.
ha: Ma'aikatan da aka amince wa kawai.

source: Unit/Jurisdiction
ha: Sashe / Hurumi

source: Video published to feed.
ha: An wallafa bidiyo a dandalin.

source: Username updated.
ha: An sabunta sunan shiga.

source: Username already taken.
ha: Wani ya riga ya yi amfani da wannan sunan.

source: Member
ha: Mamba

source: Amount
ha: Adadi

source: Reference
ha: Shaida

source: Status
ha: Yanayi

source: Date
ha: Kwanan Wata

source: Enter your full name
ha: Saka cikakken sunanka

source: Enter your email address
ha: Saka adireshin imel dinka

source: Enter your phone number
ha: Saka lambar wayarka

source: e.g., Zakat
ha: misali, Zakka

source: Enter any additional notes (optional)
ha: Saka karin bayani (idan akwai)

source: Full Name
ha: Cikakken Suna

source: Email
ha: Imel

source: Phone Number
ha: Lambar Waya

source: Amount (₦)
ha: Adadi (₦)

source: Purpose
ha: Dalili

source: Notes (Optional)
ha: Bayani (Zabi)

source: Payment Method
ha: Hanyar Biyan Kudi

source: Expiry Date
ha: Ranar Karewa

source: Cardholder Name
ha: Sunan dake jikin kati

source: Name as it appears on card
ha: Suna kamar yadda yake a jikin kati

source: English
ha: Turanci

source: Arabic
ha: Larabci

source: French
ha: Faransanci

source: Warning: Delete Account
ha: Gargaɗi: Goge Asusun

source: Are you sure you want to delete your JIBWIS profile? This action cannot be undone.
ha: Kuna da tabbacin kuna son goge bayanan JIBWIS dinku? Ba za a iya dawo da su ba.

source: Yes, Delete My Account
ha: Eh, Goge Asusuna

source: Cancel
ha: Soke

source: Edit Profile Details
ha: Gyara Bayanan Mutum

source: Organization & Payment
ha: Ƙungiya da Biya

source: New
ha: Sabuwa

source: From
ha: Daga

source: Directory
ha: Kundin Sunaye

source: Suspended
ha: An Dakatar

source: Account
ha: Asusu

source: Phone
ha: Wayar Tarho

source: Message Selected
ha: Aika sako ga wadanda aka zaba

source: Personnel
ha: Ma'aikata

source: Position
ha: Matsayi

source: Actions
ha: Ayyuka

source: Active
ha: Yana Aiki

source: View Profile
ha: Duba Bayanai

source: Subject
ha: Maudu'i

source: Reason for suspending
ha: Dalilin dakatarwa

source: Member Registration
ha: Rajistar Mambobi

source: Navigation
ha: Kewayawa

source: Full Directory
ha: Cikakken Kundin Sunaye

source: Unit Filters
ha: Matatan Rassa

source: Member Status
ha: Yanayin Mamba

source: All Members
ha: Dukkan Mambobi

source: Active Only
ha: Masu Aiki Kawai

source: Position/Role
ha: Matsayi/Makaminsa

source: Apply Filters
ha: Saka Matatun

source: Reset All
ha: Goge Komai

source: Search by name or phone in your unit...
ha: Nemi suna ko lambar waya a reshenku...

source: Search
ha: Nema

source: Results for
ha: Sakamako na

source: Account Info
ha: Bayanin Asusu

source: Management
ha: Gudanarwa

source: View File
ha: Duba Fayil

source: Suspend
ha: Dakatar

source: Activate
ha: Kunna

source: Permanent Removal
ha: Goge na Din-din-din

source: No members found in your unit matching this criteria.
ha: Ba a sami mambobi a reshenku da suka dace da wannan bayanan ba.

source: Violation of rules
ha: Saba ka'idoji

source: WARNING: This will PERMANENTLY delete
ha: GARGAƊI: Wannan zai goge

source: from JIBWIS records. Proceed?
ha: daga bayanan JIBWIS har abada. A ci gaba?

source: New Official Memo
ha: Sabuwar Takardar Hukuma

source: Recipient
ha: Mai Karba

source: Enter memo title...
ha: Saka taken takardar...

source: Message Body
ha: Sakon kansa

source: Type your message here...
ha: Rubuta sakonka a nan...

source: Send Message
ha: Aika Sako

source: To
ha: Zuwa

source: Change Username
ha: Canza Sunan Shiga

source: Current Username:
ha: Sunan Shiga na Yanzu:

source: Update Username
ha: Sabunta Sunan Shiga

source: JIBWIS Nigeria Portal
ha: Shafin JIBWIS Nijeriya

source: PORTAL
ha: SHAFIN

source: Home
ha: Gida

source: Logout
ha: Fita

source: Login
ha: Shiga

source: Join Us
ha: Shiga Cikinmu

source: Donate
ha: Bayar da Taimako

source: Nigeria National Headquarters
ha: Hedikwatar Kasa ta Nijeriya

source: Digital Management System | Developed for JIBWIS Nigeria
ha: Tsarin Gudanarwa na Dijital | An samarwa JIBWIS Nijeriya

source: Paystack Transfer Balance
ha: Sauran Kudin Paystack

source: Funds available for immediate disbursement.
ha: Kudaden da za a iya turawa yanzu.

source: Refresh Balance
ha: Sabunta Ma'aunin Kudi

source: Category Payroll
ha: Rukunin Biyan Albashi

source: Managing
ha: Gudanarwa

source: Search by name or unit/state...
ha: Nemo suna ko reshe/jiha...

source: Filter
ha: Tace

source: Scope
ha: Fadin Aiki

source: Full Hierarchy (National)
ha: Dukkan Matakai (Kasa)

source: Restricted
ha: An Takaita

source: Unit / Level
ha: Reshe / Mataki

source: No matches found for
ha: Ba a sami sakamako na

source: Selected
ha: Wadanda aka zaba

source: Execute Disbursement
ha: Aiwwatar da Biyan

source: Command Center
ha: Wajen Gudanarwa

source: Approve
ha: Amince

source: Bulk Payroll
ha: Biyan Albashin Jama'a

source: My Inbox
ha: Sakonni Na

source: Recent Messages
ha: Sakonni na kwanan nan

source: National Disciplinary Portal
ha: Shafin Hukuntawa na Kasa

source: High Clearance Only
ha: Masu Babban Iko Kawai

source: Reporter (Member)
ha: Mai Kai Karar (Mamba)

source: Subject (Leader)
ha: Wanda Ake Kara (Shugaba)

source: Action
ha: Mataki

source: Pending Review
ha: Yana Jiran Dubawa

source: Under Investigation
ha: Ana Bincike

source: Resolved
ha: An Magance

source: No active reports found.
ha: Ba a sami rahotannin da ake aiki a kansu ba.

source: Bank Transfer Payment
ha: Biyan Kudi ta Banki

source: Contribution Summary
ha: Takaitaccen Taimakon

source: Your Name:
ha: Sunanka:

source: Amount:
ha: Adadi:

source: Purpose:
ha: Dalili:

source: Verification Reference:
ha: Shaidar Tabbatarwa:

source: Bank Account Details
ha: Bayanin Asusun Banki

source: Bank Name:
ha: Sunan Banki:

source: Account Name:
ha: Sunan Asusu:

source: Account Number:
ha: Lambar Asusu:

source: Reference Note:
ha: Bayanin Shaida:

source: Important Instructions:
ha: Muhimman Umarni:

source: Verification may take up to 24 hours to reflect.
ha: Tabbatarwa na iya daukar har sa'o'i 24.

source: Please keep your transfer receipt for your records.
ha: Don Allah a adana takardar biyan don shaida.

source: For support, contact us at +234 800 000 0000.
ha: Domin taimako, tuntube mu a +234 800 000 0000.

source: Confirm Payment
ha: Tabbatar da Biya

source: To confirm that you have made the transfer, please check the box below:
ha: Domin tabbatar da cewa ka tura kudin, don Allah taba hoton akwati na kasa:

source: I Have Sent the Money
ha: Na Tura Kudin

source: Go Back
ha: Koma Baya

source: Card Payment
ha: Biyan Kudi ta Kati

source: You will be redirected to a secure payment gateway to complete your transaction.
ha: Za a tura ku zuwa wani amintaccen shafin biyan kudi domin kammala aikin.

source: Reference Code:
ha: Lambar Shaida:

source: Expiry (MM/YY)
ha: Karewa (Wata/Shekara)

source: Name on Card
ha: Sunan dake kan Kati

source: Your card details are securely encrypted. We do not store your full card information on our servers.
ha: Bayanan katinku suna nan cikin tsaro. Ba ma adana cikakkun bayanan katin a cikin na'urorinmu.

source: Pay ₦%(amt)s
ha: Biya ₦%(amt)s

source: Secure
ha: Amintacce

source: Izala Group
ha: Izala

source: Contribution Confirmation
ha: Tabbatar da Taimako

source: Dear %(name)s,
ha: Zuwa ga %(name)s,

source: We are pleased to inform you that your contribution has been received.
ha: Muna farin cikin sanar da kai cewa taimakonka ya iso.

source: Contribution Details:
ha: Bayanan Taimakon:

source: Payment Method:
ha: Hanyar Biyan:

source: Date:
ha: Kwanan Wata:

source: Our sincere gratitude goes to everyone who contributes. Your support will greatly help the community.
ha: Godiya ta musamman ga duk wanda ya bayar da taimako. Taimakonku zai amfani al'umma sosai.

source: If you have any questions, please reply to this email or contact us at:
ha: Idan kana da tambaya, don Allah ka ba da amsa ga wannan imel din ko ka tuntube mu a:

source: Izala Group. All rights reserved.
ha: Kungiyar Izala. An kiyaye dukkan hakki.

source: Dedicated to serving the community
ha: An sadaukar domin hidimar al'umma

source: Contribute Zakat/Sadaqah
ha: Bayar da Zakka/Sadaka

source: Donor Information
ha: Bayanin Mai Taimako

source: Contribution Details
ha: Bayanin Taimakon

source: Minimum amount is ₦100
ha: Adadi mafi kankanta shine ₦100

source: Use your bank debit/credit card
ha: Yi amfani da katin bankinka

source: Bank Transfer
ha: Canjin Banki

source: Transfer directly from your bank app
ha: Tura kudi kai tsaye daga manhajar bankinka

source: Proceed to Contribute
ha: Ci gaba da Taimako

source: Minimum donation amount is ₦100
ha: Adadi mafi kankanta na taimako shine ₦100

source: Please select a payment method
ha: Don Allah zabi hanyar biya

source: Donation Records
ha: Bayanan Taimako

source: Add Manual Donation
ha: Kara Taimako da Hannu

source: Gateway Settings
ha: Saitunan Hanyar Biya

source: All Statuses
ha: Dukkan Yanayi

source: Pending
ha: Yana Jira

source: Completed
ha: An Kammala

source: Failed
ha: Ba a Nasara ba

source: All Methods
ha: Dukkan Hanyoyi

source: Cash
ha: Tsabar Kudi

source: Clear
ha: Goge

source: Total Donations:
ha: Jimillar Taimako:

source: Donor
ha: Mai Taimako

source: Method
ha: Hanya

source: No email
ha: Babu imel

source: General
ha: Gaba-daya

source: Donation Details
ha: Bayanin Taimako

source: Donor:
ha: Mai Taimako:

source: Email:
ha: Imel:

source: Phone:
ha: Waya:

source: Method:
ha: Hanya:

source: Status:
ha: Yanayi:

source: Notes:
ha: Karin Bayani:

source: None
ha: Babu

source: Transaction ID:
ha: Lambar Aiki:

source: No donations found
ha: Ba a sami taimako ba

source: Payment Pending
ha: Biya na Jiran Tabbatarwa

source: We are waiting to confirm your contribution
ha: Muna jiran tabbatar da taimakonka

source: Donor Name:
ha: Sunan Mai Taimako:

source: Reference Number:
ha: Lambar Shaida:

source: What happens next?
ha: Me zai faru daga baya?

source: We will verify the bank records for your payment.
ha: Zamu duba bayanan banki domin tabbatar da biyanka.

source: This process may take up to 24 hours.
ha: Wannan aikin na iya daukar har sa'o'i 24.

source: You will receive a confirmation email once the status is updated.
ha: Zaka sami imel na tabbatarwa da zarar mun sabunta bayanan.

source: If not confirmed within 2 days, please contact our support.
ha: Idan ba a tabbatar ba cikin kwana 2, don Allah tuntube mu.

source: Make Another Contribution
ha: Yi Wani Taimakon Kuma

source: Check Status
ha: Duba Yanayi

source: For inquiries, contact us at
ha: Domin karin bayani, tuntube mu a

source: or
ha: ko

source: Check Payment Status
ha: Duba Yanayin Biya

source: Checking payment status...
ha: Ana duba yanayin biya...

source: Refresh
ha: Sabunta

source: Payment Successful!
ha: Biyan Ya Yi Nasara!

source: Your payment was confirmed on
ha: An tabbatar da biyanka a ranar

source: View Confirmation
ha: Duba Tabbatarwa

source: We are still waiting to confirm your payment
ha: Muna jiran tabbatar da biyanka har yanzu

source: No Update Found
ha: Babu Wani Sabon Bayani

source: There is no new information regarding your payment
ha: Babu wani sabon bayani game da biyanka

source: Thank You!
ha: Mun Gode!

source: Your contribution was successful
ha: Taimakonka ya yi nasara

source: We will send a confirmation receipt to your email
ha: Zamu tura takardar shaidar biya zuwa imel dinka

source: once the transaction is fully processed
ha: da zarar an kammala sarrafa aikin gaba-daya

source: Print Receipt
ha: Buga Takardar Shaida

source: If you have any questions regarding this contribution,
ha: Idan kana da tambaya game da wannan taimakon,

source: please contact us at
ha: don Allah tuntube mu a

source: Authorize Disbursement
ha: Bada Ikon Biyan Kudi

source: Confirm Unit Payroll
ha: Tabbatar da Biyan Albashin Reshe

source: You are about to process payments for selected members of <strong>%(unit)s</strong>. This action will trigger bank transfers and cannot be reversed once executed.
ha: Kana shirin biyan mambobin <strong>%(unit)s</strong> da aka zaba. Wannan aikin zai tura kudi ta banki kuma ba za a iya soke shi ba da zarar an fara.

source: Only 'Active' members selected in the table will be processed.
ha: Mambobin da suke 'Active' kawai a cikin tebur din za a biya.

source: Review List
ha: Duba Jerin

source: Process Now
ha: Fara Yanzu

source: NAVIGATION
ha: MAHUYI

source: Payroll History
ha: Tarihin Biyan Kudade

source: SETTINGS
ha: SAITUNA

source: My Profile
ha: Bayanan Suna

source: Updates
ha: Sababbin Labarai

source: Welcome to our official portal. Stay tuned for live updates.
ha: Barka da zuwa shafinmu na hukuma. Kasance da mu don samun sababbin labarai.

source: JIBWIS Digital Portal
ha: Shafin JIBWIS na Dijital

source: Unifying the Sunnah across Nigeria: Admin • Ulama • FAG
ha: Hada kan mabiya Sunnah a fadin Nijeriya: Admin • Ulama • FAG

source: Join Now
ha: Shiga Yanzu

source: Administration
ha: Gudanarwa

source: National to Ward level leadership coordination.
ha: Gudanar da shugabanci daga matakin Kasa har zuwa mazabu.

source: Council of Ulama
ha: Majalisar Malamai

source: Management of scholars and educational backgrounds.
ha: Gudanar da bayanan malamai da iliminsu.

source: First Aid Group
ha: Masu Agaji (FAG)

source: Divisional, Detachment, and Unit leadership.
ha: Shugabancin Divisional, Detachment, da kuma Unit.

source: Visit Us
ha: Ziyarce Mu

source: JIBWIS National Headquarters,
ha: Hedikwatar JIBWIS ta Kasa,

source: Kaduna, Kaduna State, Nigeria.
ha: Kaduna, Jihar Kaduna, Nijeriya.

source: Latest Announcements
ha: Sanarwar Kwanan Nan

source: Read More
ha: Kara Karantawa

source: JIBWIS Media Updates
ha: Labaran Kafafen Yada Labarai na JIBWIS

source: Share
ha: Aika

source: Download
ha: Sauke

source: Portal Login
ha: Shiga Shafin

source: Username
ha: Sunan Shiga

source: Password
ha: Kalmar Sirri

source: Reset Your Password
ha: Sake Saita Kalmar Sirri

source: Enter your email address below, and we'll email instructions for setting a new one.
ha: Saka adireshin imel dinka a kasa, zamu tura maka matakan saka sabuwar kalmar sirri.

source: Send Reset Email
ha: Aika Imel din Sake Saitawa

source: Password Reset Complete
ha: An kammala sake saita kalmar sirri

source: Your new password has been set. You may go ahead and log in now.
ha: An riga an saita sabuwar kalmar sirrinka. Yanzu zaka iya shiga.

source: Login to Portal
ha: Shiga Shafin

source: New Password
ha: Sabuwar Kalmar Sirri

source: Please enter your new password below.
ha: Don Allah saka sabuwar kalmar sirrinka a kasa.

source: Reset Password
ha: Sake Saita Kalmar Sirri

source: This password reset link is invalid or has expired.
ha: Wannan hanyar sake saita kalmar sirrin ba ta da kyau ko kuma ta dade.

source: Request a new link
ha: Nemi wata hanyar

source: Check Your Email
ha: Duba Imel Dinka

source: We've emailed you instructions for setting your password. You should receive them shortly.
ha: Mun tura maka bayanan yadda zaka sake saita kalmar sirri. Zaka gansu nan ba dadewa ba.

source: If you don't receive an email, please ensure you've entered the address you registered with and check your spam folder.
ha: Idan ba ka ga imel ba, ka tabbatar ka saka adireshin da ka yi rajista da shi, kuma ka duba 'spam folder'.

source: To initiate the password reset process for your JIBWIS account, click the link below:
ha: Don fara sake saita kalmar sirrin asusunka na JIBWIS, taba wannan hanyar ta kasa:

source: If clicking the link doesn't work, please copy and paste the URL into your browser.
ha: Idan tabawa ba ta yi aiki ba, kwafo adireshin ka saka shi a manhajar bincikenka.

source: Disbursement Ledger
ha: Kundin Tarihin Biya

source: New Disbursement
ha: Sabon Biya

source: Date & Time
ha: Kwanan Wata da Lokaci

source: Paid
ha: An Biya

source: No disbursement records found.
ha: Ba a sami bayanan biya ba.

source: Pending Member Verifications
ha: Mambobin da ke Jiran Tabbatarwa

source: Registration Date
ha: Ranar Rajista

source: Bank:
ha: Banki:

source: Education:
ha: Ilimi:

source: Position:
ha: Matsayi:

source: Verified via Moniepoint/Paystack:
ha: An tantance ta Moniepoint/Paystack:

source: Account Validated
ha: An tabbatar da asusun

source: Account Not Validated
ha: Ba a tabbatar da asusun ba

source: Upload Short Video
ha: Dora Gajeren Bidiyo

source: Videos will auto-play on hover on the landing page. Recommended format: Vertical (9:16).
ha: Bidiyo zai fara wasa da kansa idan aka kai sanda kansa a shafin farko. Tsarin da aka fi so: Tsaye (9:16).

source: Publish Video
ha: Wallafa Bidiyo

source: Cancel and Return
ha: Soke kuma Koma Baya
